{"id": "1da8ce0b-855d-4004-8860-7d64d42063b1", "name": "SIGMA - Apache Segmentation Fault", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects a segmentation fault error message caused by a crashing apache worker process", "rule_id": "1da8ce0b-855d-4004-8860-7d64d42063b1", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1499", "reference": "https://attack.mitre.org/techniques/T1499", "name": "Endpoint Denial of Service", "subtechnique": [{"id": "T1499.004", "reference": "https://attack.mitre.org/techniques/T1499/004", "name": "Application or System Exploitation"}]}]}], "tags": [], "to": "now", "references": ["http://www.securityfocus.com/infocus/1633"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"exit signal Segmentation Fault\"", "filters": [], "actions": []}
{"id": "e9a2b582-3f6a-48ac-b4a1-6849cdc50b3c", "name": "SIGMA - Apache Threading Error", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects an issue in apache logs that reports threading related errors", "rule_id": "e9a2b582-3f6a-48ac-b4a1-6849cdc50b3c", "false_positives": ["3rd party apache modules - https://bz.apache.org/bugzilla/show_bug.cgi?id=46185"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1210", "reference": "https://attack.mitre.org/techniques/T1210", "name": "Exploitation of Remote Services", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/hannob/apache-uaf/blob/da40f2be3684c8095ec6066fa68eb5c07a086233/README.md"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"__pthread_tpp_change_priority: Assertion `new_prio == -1 || (new_prio >= fifo_min_prio && new_prio <= fifo_max_prio)\"", "filters": [], "actions": []}
