{"id": "ceb407f6-8277-439b-951f-e4210e3ed956", "name": "SIGMA - Cisco Clear Logs", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Clear command history in network OS which is used for defense evasion", "rule_id": "ceb407f6-8277-439b-951f-e4210e3ed956", "false_positives": ["Legitimate administrators may run these commands"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "reference": "https://attack.mitre.org/techniques/T1070", "name": "Indicator Removal", "subtechnique": [{"id": "T1070.003", "reference": "https://attack.mitre.org/techniques/T1070/003", "name": "Clear Command History"}]}]}], "tags": [], "to": "now", "references": ["https://www.cisco.com/c/en/us/td/docs/switches/datacenter/nexus5000/sw/command/reference/sysmgmt/n5k-sysmgmt-cr/n5k-sm_cmds_c.html", "https://www.cisco.com/c/en/us/td/docs/ios/12_2sr/12_2sra/feature/guide/srmgtint.html#wp1127609"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"clear logging\" or \"clear archive\"", "filters": [], "actions": []}
{"id": "cd072b25-a418-4f98-8ebc-5093fb38fe1a", "name": "SIGMA - Cisco Collect Data", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Collect pertinent data from the configuration files", "rule_id": "cd072b25-a418-4f98-8ebc-5093fb38fe1a", "false_positives": ["Commonly run by administrators"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1087", "reference": "https://attack.mitre.org/techniques/T1087", "name": "Account Discovery", "subtechnique": [{"id": "T1087.001", "reference": "https://attack.mitre.org/techniques/T1087/001", "name": "Local Account"}]}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1552", "reference": "https://attack.mitre.org/techniques/T1552", "name": "Unsecured Credentials", "subtechnique": [{"id": "T1552.001", "reference": "https://attack.mitre.org/techniques/T1552/001", "name": "Credentials In Files"}]}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1005", "reference": "https://attack.mitre.org/techniques/T1005", "name": "Data from Local System", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://blog.router-switch.com/2013/11/show-running-config/", "https://www.cisco.com/E-Learning/bulk/public/tac/cim/cib/using_cisco_ios_software/cmdrefs/show_startup-config.htm", "https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/config-mgmt/configuration/15-sy/config-mgmt-15-sy-book/cm-config-diff.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"show running-config\" or \"show startup-config\" or \"show archive config\" or \"more\"", "filters": [], "actions": []}
{"id": "1f978c6a-4415-47fb-aca5-736a44d7ca3d", "name": "SIGMA - Cisco Crypto Commands", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Show when private keys are being exported from the device, or when new certificates are installed", "rule_id": "1f978c6a-4415-47fb-aca5-736a44d7ca3d", "false_positives": ["Not commonly run by administrators. Also whitelist your known good certificates"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1553", "reference": "https://attack.mitre.org/techniques/T1553", "name": "Subvert Trust Controls", "subtechnique": [{"id": "T1553.004", "reference": "https://attack.mitre.org/techniques/T1553/004", "name": "Install Root Certificate"}]}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1552", "reference": "https://attack.mitre.org/techniques/T1552", "name": "Unsecured Credentials", "subtechnique": [{"id": "T1552.004", "reference": "https://attack.mitre.org/techniques/T1552/004", "name": "Private Keys"}]}]}], "tags": [], "to": "now", "references": ["https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/security/a1/sec-a1-cr-book/sec-a1-cr-book_chapter_0111.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"crypto pki export\" or \"crypto pki import\" or \"crypto pki trustpoint\"", "filters": [], "actions": []}
{"id": "9e8f6035-88bf-4a63-96b6-b17c0508257e", "name": "SIGMA - Cisco Disabling Logging", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Turn off logging locally or remote", "rule_id": "9e8f6035-88bf-4a63-96b6-b17c0508257e", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "reference": "https://attack.mitre.org/techniques/T1562", "name": "Impair Defenses", "subtechnique": [{"id": "T1562.001", "reference": "https://attack.mitre.org/techniques/T1562/001", "name": "Disable or Modify Tools"}]}]}], "tags": [], "to": "now", "references": ["https://www.cisco.com/en/US/docs/ios/security/command/reference/sec_a2.pdf"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"no logging\" or \"no aaa new-model\"", "filters": [], "actions": []}
{"id": "9705a6a1-6db6-4a16-a987-15b7151e299b", "name": "SIGMA - Cisco Discovery", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Find information about network devices that is not stored in config files", "rule_id": "9705a6a1-6db6-4a16-a987-15b7151e299b", "false_positives": ["Commonly used by administrators for troubleshooting"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1083", "reference": "https://attack.mitre.org/techniques/T1083", "name": "File and Directory Discovery", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.cisco.com/c/en/us/td/docs/server_nw_virtual/2-5_release/command_reference/show.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"dir\" or \"show arp\" or \"show cdp\" or \"show clock\" or \"show ip interface\" or \"show ip route\" or \"show ip sockets\" or \"show processes\" or \"show ssh\" or \"show users\" or \"show version\"", "filters": [], "actions": []}
{"id": "d94a35f0-7a29-45f6-90a0-80df6159967c", "name": "SIGMA - Cisco Denial of Service", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Detect a system being shutdown or put into different boot mode", "rule_id": "d94a35f0-7a29-45f6-90a0-80df6159967c", "false_positives": ["Legitimate administrators may run these commands, though rarely."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1495", "reference": "https://attack.mitre.org/techniques/T1495", "name": "Firmware Corruption", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"shutdown\" or \"config-register 0x2100\" or \"config-register 0x2142\"", "filters": [], "actions": []}
{"id": "71d65515-c436-43c0-841b-236b1f32c21e", "name": "SIGMA - Cisco File Deletion", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "See what files are being deleted from flash file systems", "rule_id": "71d65515-c436-43c0-841b-236b1f32c21e", "false_positives": ["Will be used sometimes by admins to clean up local flash space"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "reference": "https://attack.mitre.org/techniques/T1070", "name": "Indicator Removal", "subtechnique": [{"id": "T1070.004", "reference": "https://attack.mitre.org/techniques/T1070/004", "name": "File Deletion"}]}]}, {"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1561", "reference": "https://attack.mitre.org/techniques/T1561", "name": "Disk Wipe", "subtechnique": [{"id": "T1561.001", "reference": "https://attack.mitre.org/techniques/T1561/001", "name": "Disk Content Wipe"}]}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"erase\" or \"delete\" or \"format\"", "filters": [], "actions": []}
{"id": "b094d9fb-b1ad-4650-9f1a-fb7be9f1d34b", "name": "SIGMA - Cisco Show Commands Input", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "See what commands are being input into the device by other people, full credentials can be in the history", "rule_id": "b094d9fb-b1ad-4650-9f1a-fb7be9f1d34b", "false_positives": ["Not commonly run by administrators, especially if remote logging is configured"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1552", "reference": "https://attack.mitre.org/techniques/T1552", "name": "Unsecured Credentials", "subtechnique": [{"id": "T1552.003", "reference": "https://attack.mitre.org/techniques/T1552/003", "name": "Bash History"}]}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"show history\" or \"show history all\" or \"show logging\"", "filters": [], "actions": []}
{"id": "6d844f0f-1c18-41af-8f19-33e7654edfc3", "name": "SIGMA - Cisco Local Accounts", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Find local accounts being created or modified as well as remote authentication configurations", "rule_id": "6d844f0f-1c18-41af-8f19-33e7654edfc3", "false_positives": ["When remote authentication is in place, this should not change often"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1136", "reference": "https://attack.mitre.org/techniques/T1136", "name": "Create Account", "subtechnique": [{"id": "T1136.001", "reference": "https://attack.mitre.org/techniques/T1136/001", "name": "Local Account"}]}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1098", "reference": "https://attack.mitre.org/techniques/T1098", "name": "Account Manipulation", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"username\" or \"aaa\"", "filters": [], "actions": []}
{"id": "671ffc77-50a7-464f-9e3d-9ea2b493b26b", "name": "SIGMA - Cisco Modify Configuration", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Modifications to a config that will serve an adversary's impacts or persistence", "rule_id": "671ffc77-50a7-464f-9e3d-9ea2b493b26b", "false_positives": ["Legitimate administrators may run these commands"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1490", "reference": "https://attack.mitre.org/techniques/T1490", "name": "Inhibit System Recovery", "subtechnique": []}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1505", "reference": "https://attack.mitre.org/techniques/T1505", "name": "Server Software Component", "subtechnique": []}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1565", "reference": "https://attack.mitre.org/techniques/T1565", "name": "Data Manipulation", "subtechnique": [{"id": "T1565.002", "reference": "https://attack.mitre.org/techniques/T1565/002", "name": "Transmitted Data Manipulation"}]}]}, {"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "reference": "https://attack.mitre.org/techniques/T1053", "name": "Scheduled Task/Job", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"ip http server\" or \"ip https server\" or \"kron policy-list\" or \"kron occurrence\" or \"policy-list\" or \"access-list\" or \"ip access-group\" or \"archive maximum\" or \"ntp server\"", "filters": [], "actions": []}
{"id": "5e51acb2-bcbe-435b-99c6-0e3cd5e2aa59", "name": "SIGMA - Cisco Stage Data", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Various protocols maybe used to put data on the device for exfil or infil", "rule_id": "5e51acb2-bcbe-435b-99c6-0e3cd5e2aa59", "false_positives": ["Generally used to copy configs or IOS images"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1074", "reference": "https://attack.mitre.org/techniques/T1074", "name": "Data Staged", "subtechnique": []}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1105", "reference": "https://attack.mitre.org/techniques/T1105", "name": "Ingress Tool Transfer", "subtechnique": []}]}, {"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1560", "reference": "https://attack.mitre.org/techniques/T1560", "name": "Archive Collected Data", "subtechnique": [{"id": "T1560.001", "reference": "https://attack.mitre.org/techniques/T1560/001", "name": "Archive via Utility"}]}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"tftp\" or \"rcp\" or \"puts\" or \"copy\" or \"configure replace\" or \"archive tar\"", "filters": [], "actions": []}
{"id": "b9e1f193-d236-4451-aaae-2f3d2102120d", "name": "SIGMA - Cisco Sniffing", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Austin Clark"], "description": "Show when a monitor or a span/rspan is setup or modified", "rule_id": "b9e1f193-d236-4451-aaae-2f3d2102120d", "false_positives": ["Admins may setup new or modify old spans, or use a monitor for troubleshooting"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1040", "reference": "https://attack.mitre.org/techniques/T1040", "name": "Network Sniffing", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"monitor capture point\" or \"set span\" or \"set rspan\"", "filters": [], "actions": []}
{"id": "56fa3cd6-f8d6-4520-a8c7-607292971886", "name": "SIGMA - Cisco BGP Authentication Failures", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Tim Brown"], "description": "Detects BGP failures which may be indicative of brute force attacks to manipulate routing", "rule_id": "56fa3cd6-f8d6-4520-a8c7-607292971886", "false_positives": ["Unlikely. Except due to misconfigurations"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "reference": "https://attack.mitre.org/techniques/T1078", "name": "Valid Accounts", "subtechnique": []}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1110", "reference": "https://attack.mitre.org/techniques/T1110", "name": "Brute Force", "subtechnique": []}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1557", "reference": "https://attack.mitre.org/techniques/T1557", "name": "Adversary-in-the-Middle", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \":179\" and \"IP-TCP-3-BADAUTH\"", "filters": [], "actions": []}
{"id": "50e606bf-04ce-4ca7-9d54-3449494bbd4b", "name": "SIGMA - Cisco LDP Authentication Failures", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Tim Brown"], "description": "Detects LDP failures which may be indicative of brute force attacks to manipulate MPLS labels", "rule_id": "50e606bf-04ce-4ca7-9d54-3449494bbd4b", "false_positives": ["Unlikely. Except due to misconfigurations"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "reference": "https://attack.mitre.org/techniques/T1078", "name": "Valid Accounts", "subtechnique": []}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1110", "reference": "https://attack.mitre.org/techniques/T1110", "name": "Brute Force", "subtechnique": []}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1557", "reference": "https://attack.mitre.org/techniques/T1557", "name": "Adversary-in-the-Middle", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"LDP\" and (\"SOCKET_TCP_PACKET_MD5_AUTHEN_FAIL\" or \"TCPMD5AuthenFail\")", "filters": [], "actions": []}
