{"id": "1a395cbc-a84a-463a-9086-ed8a70e573c7", "name": "SIGMA - Default Credentials Usage", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Alexandr Yampolskyi, SOC Prime"], "description": "Before deploying any new asset, change all default passwords to have values consistent with administrative level accounts.\nSigma detects default credentials usage. Sigma for Qualys vulnerability scanner. Scan type - Vulnerability Management.\n", "rule_id": "1a395cbc-a84a-463a-9086-ed8a70e573c7", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-initial-access"], "to": "now", "references": ["https://www.cisecurity.org/controls/cis-controls-list/", "https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf", "https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf", "https://community.qualys.com/docs/DOC-6406-reporting-toolbox-focused-search-lists"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where host.scan.vuln like~ (10693, 11507, 11633, 11804, 11821, 11847, 11867, 11931, 11935, 11950, 12541, 12558, 12559, 12560, 12562, 12563, 12565, 12587, 12590, 12599, 12702, 12705, 12706, 12907, 12928, 12929, 13053, 13178, 13200, 13218, 13241, 13253, 13274, 13296, 13301, 13327, 13373, 13374, 13409, 13530, 13532, 20065, 20073, 20081, 27202, 27358, 38702, 38719, 42045, 42417, 43029, 43220, 43221, 43222, 43223, 43225, 43246, 43431, 43484, 86857, 87098, 87106)", "filters": [], "actions": []}
{"id": "6b2066c8-3dc7-4db7-9db0-6cc1d7b0dde9", "name": "SIGMA - Host Without Firewall", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Alexandr Yampolskyi, SOC Prime"], "description": "Host Without Firewall. Alert means not complied. Sigma for Qualys vulnerability scanner. Scan type - Vulnerability Management.", "rule_id": "6b2066c8-3dc7-4db7-9db0-6cc1d7b0dde9", "false_positives": [], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": [], "to": "now", "references": ["https://www.cisecurity.org/controls/cis-controls-list/", "https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf", "https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where event.category:\"Security Policy\" and host.scan.vuln_name:\"*Firewall Product Not Detected*\"", "filters": [], "actions": []}
{"id": "7e4bfe58-4a47-4709-828d-d86c78b7cc1f", "name": "SIGMA - Cleartext Protocol Usage Via Netflow", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Alexandr Yampolskyi, SOC Prime"], "description": "Ensure that all account usernames and authentication credentials are transmitted across networks using encrypted channels\nEnsure that an encryption is used for all sensitive information in transit.\nEnsure that an encrypted channels is used for all administrative account access.\n", "rule_id": "7e4bfe58-4a47-4709-828d-d86c78b7cc1f", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-credential-access"], "to": "now", "references": ["https://www.cisecurity.org/controls/cis-controls-list/", "https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf", "https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where destination.port like~ (8080, 21, 80, 23, 50000, 1521, 27017, 1433, 11211, 3306, 15672, 5900, 5901, 5902, 5903, 5904)", "filters": [], "actions": []}
