{"id": "2e4e488a-6164-4811-9ea1-f960c7359c40", "name": "SIGMA - HackTool - CACTUSTORCH Remote Thread Creation", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@SBousseaden (detection), Thomas Patzke (rule)"], "description": "Detects remote thread creation from CACTUSTORCH as described in references.", "rule_id": "2e4e488a-6164-4811-9ea1-f960c7359c40", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": [{"id": "T1055.012", "reference": "https://attack.mitre.org/techniques/T1055/012", "name": "Process Hollowing"}]}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "reference": "https://attack.mitre.org/techniques/T1059", "name": "Command and Scripting Interpreter", "subtechnique": [{"id": "T1059.005", "reference": "https://attack.mitre.org/techniques/T1059/005", "name": "Visual Basic"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "reference": "https://attack.mitre.org/techniques/T1059", "name": "Command and Scripting Interpreter", "subtechnique": [{"id": "T1059.007", "reference": "https://attack.mitre.org/techniques/T1059/007", "name": "JavaScript"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/SBousseaden/status/1090588499517079552", "https://github.com/mdsecactivebreach/CACTUSTORCH"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and ((SourceImage like~ (\"*\\\\System32\\\\cscript.exe\", \"*\\\\System32\\\\wscript.exe\", \"*\\\\System32\\\\mshta.exe\", \"*\\\\winword.exe\", \"*\\\\excel.exe\")) and TargetImage:\"*\\\\SysWOW64\\\\*\" and (?StartModule == null))", "filters": [], "actions": []}
{"id": "6309645e-122d-4c5b-bb2b-22e4f9c2fa42", "name": "SIGMA - HackTool - Potential CobaltStrike Process Injection", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Olaf Hartong, Florian Roth (Nextron Systems), Aleksey Potapov, oscd.community"], "description": "Detects a potential remote threat creation with certain characteristics which are typical for Cobalt Strike beacons", "rule_id": "6309645e-122d-4c5b-bb2b-22e4f9c2fa42", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": [{"id": "T1055.001", "reference": "https://attack.mitre.org/techniques/T1055/001", "name": "Dynamic-link Library Injection"}]}]}], "tags": [], "to": "now", "references": ["https://medium.com/@olafhartong/cobalt-strike-remote-threads-detection-206372d11d0f", "https://blog.cobaltstrike.com/2018/04/09/cobalt-strike-3-11-the-snake-that-eats-its-tail/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and (StartAddress like~ (\"*0B80\", \"*0C7C\", \"*0C88\"))", "filters": [], "actions": []}
{"id": "77564cc2-7382-438b-a7f6-395c2ae53b9a", "name": "SIGMA - Remote Thread Created In KeePass.EXE", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Timon Hackenjos"], "description": "Detects remote thread creation in \"KeePass.exe\" which could indicates potential password dumping activity", "rule_id": "77564cc2-7382-438b-a7f6-395c2ae53b9a", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1555", "reference": "https://attack.mitre.org/techniques/T1555", "name": "Credentials from Password Stores", "subtechnique": [{"id": "T1555.005", "reference": "https://attack.mitre.org/techniques/T1555/005", "name": "Password Managers"}]}]}], "tags": [], "to": "now", "references": ["https://www.cisa.gov/uscert/ncas/alerts/aa20-259a", "https://github.com/denandz/KeeFarce", "https://github.com/GhostPack/KeeThief"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and TargetImage:\"*\\\\KeePass.exe\"", "filters": [], "actions": []}
{"id": "c0aac16a-b1e7-4330-bab0-3c27bb4987c7", "name": "SIGMA - Remote Thread Creation In Mstsc.Exe From Suspicious Location", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects remote thread creation in the \"mstsc.exe\" process by a process located in a potentially suspicious location.\nThis technique is often used by attackers in order to hook some APIs used by DLLs loaded by \"mstsc.exe\" during RDP authentications in order to steal credentials.\n", "rule_id": "c0aac16a-b1e7-4330-bab0-3c27bb4987c7", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-credential-access"], "to": "now", "references": ["https://github.com/S12cybersecurity/RDPCredentialStealer/blob/1b8947cdd065a06c1b62e80967d3c7af895fcfed/APIHookInjectorBin/APIHookInjectorBin/Inject.h#L25"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and (TargetImage:\"*\\\\mstsc.exe\" and (SourceImage like~ (\"*:\\\\Temp\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\PerfLogs\\\\*\", \"*:\\\\Windows\\\\Tasks\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\")))", "filters": [], "actions": []}
{"id": "fb656378-f909-47c1-8747-278bf09f4f4f", "name": "SIGMA - Potential Credential Dumping Attempt Via PowerShell Remote Thread", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["oscd.community, Natalia Shornikova"], "description": "Detects remote thread creation by PowerShell processes into \"lsass.exe\"", "rule_id": "fb656378-f909-47c1-8747-278bf09f4f4f", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and ((SourceImage like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and TargetImage:\"*\\\\lsass.exe\")", "filters": [], "actions": []}
{"id": "99b97608-3e21-4bfe-8217-2a127c396a0e", "name": "SIGMA - Remote Thread Creation Via PowerShell In Uncommon Target", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects the creation of a remote thread from a Powershell process in an uncommon target process", "rule_id": "99b97608-3e21-4bfe-8217-2a127c396a0e", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "reference": "https://attack.mitre.org/techniques/T1218", "name": "System Binary Proxy Execution", "subtechnique": [{"id": "T1218.011", "reference": "https://attack.mitre.org/techniques/T1218/011", "name": "Rundll32"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "reference": "https://attack.mitre.org/techniques/T1059", "name": "Command and Scripting Interpreter", "subtechnique": [{"id": "T1059.001", "reference": "https://attack.mitre.org/techniques/T1059/001", "name": "PowerShell"}]}]}], "tags": [], "to": "now", "references": ["https://www.fireeye.com/blog/threat-research/2018/06/bring-your-own-land-novel-red-teaming-technique.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and ((SourceImage like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and (TargetImage like~ (\"*\\\\rundll32.exe\", \"*\\\\regsvr32.exe\")))", "filters": [], "actions": []}
{"id": "f239b326-2f41-4d6b-9dfa-c846a60ef505", "name": "SIGMA - Password Dumper Remote Thread in LSASS", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Thomas Patzke"], "description": "Detects password dumper activity by monitoring remote thread creation EventID 8 in combination with the lsass.exe process as TargetImage.\nThe process in field Process is the malicious program. A single execution can lead to hundreds of events.\n", "rule_id": "f239b326-2f41-4d6b-9dfa-c846a60ef505", "false_positives": ["Antivirus products"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and (TargetImage:\"*\\\\lsass.exe\" and StartModule==\"\")", "filters": [], "actions": []}
{"id": "02d1d718-dd13-41af-989d-ea85c7fab93f", "name": "SIGMA - Rare Remote Thread Creation By Uncommon Source Image", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Perez Diego (@darkquassar), oscd.community"], "description": "Detects uncommon processes creating remote threads.", "rule_id": "02d1d718-dd13-41af-989d-ea85c7fab93f", "false_positives": ["This rule is best put in testing first in order to create a baseline that reflects the data in your environment."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["Personal research, statistical analysis", "https://lolbas-project.github.io"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and ((SourceImage like~ (\"*\\\\bash.exe\", \"*\\\\cscript.exe\", \"*\\\\cvtres.exe\", \"*\\\\defrag.exe\", \"*\\\\dialer.exe\", \"*\\\\dnx.exe\", \"*\\\\esentutl.exe\", \"*\\\\excel.exe\", \"*\\\\expand.exe\", \"*\\\\find.exe\", \"*\\\\findstr.exe\", \"*\\\\forfiles.exe\", \"*\\\\gpupdate.exe\", \"*\\\\hh.exe\", \"*\\\\installutil.exe\", \"*\\\\lync.exe\", \"*\\\\makecab.exe\", \"*\\\\mDNSResponder.exe\", \"*\\\\monitoringhost.exe\", \"*\\\\msbuild.exe\", \"*\\\\mshta.exe\", \"*\\\\mspaint.exe\", \"*\\\\outlook.exe\", \"*\\\\ping.exe\", \"*\\\\provtool.exe\", \"*\\\\python.exe\", \"*\\\\regsvr32.exe\", \"*\\\\robocopy.exe\", \"*\\\\runonce.exe\", \"*\\\\sapcimc.exe\", \"*\\\\smartscreen.exe\", \"*\\\\spoolsv.exe\", \"*\\\\tstheme.exe\", \"*\\\\userinit.exe\", \"*\\\\vssadmin.exe\", \"*\\\\vssvc.exe\", \"*\\\\w3wp.exe\", \"*\\\\winscp.exe\", \"*\\\\winword.exe\", \"*\\\\wmic.exe\", \"*\\\\wscript.exe\")) and (not (((SourceImage like~ (\"C:\\\\Windows\\\\System32\\\\Defrag.exe\", \"C:\\\\Windows\\\\System32\\\\makecab.exe\")) and TargetImage:\"C:\\\\Windows\\\\System32\\\\conhost.exe\") or (SourceImage:\"C:\\\\Windows\\\\System32\\\\provtool.exe\" and TargetImage:\"C:\\\\Windows\\\\System32\\\\svchost.exe\") or (SourceImage:\"C:\\\\Windows\\\\System32\\\\userinit.exe\" and TargetImage:\"C:\\\\Windows\\\\explorer.exe\") or (SourceImage:\"*\\\\WINWORD.EXE\" and (TargetImage like~ (\"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Program Files\\\\*\"))) or ((SourceImage like~ (\"C:\\\\Program Files\\\\Microsoft Office\\\\*\", \"C:\\\\Program Files (x86)\\\\Microsoft Office\\\\*\")) and TargetImage:\"System\"))) and (not (SourceImage:\"*\\\\SysWOW64\\\\explorer.exe\" and (TargetImage like~ (\"C:\\\\Program Files (x86)\\\\VMware\\\\VMware Tools\\\\vmtoolsd.exe\", \"C:\\\\Program Files\\\\VMware\\\\VMware Tools\\\\vmtoolsd.exe\")))))", "filters": [], "actions": []}
{"id": "66d31e5f-52d6-40a4-9615-002d3789a119", "name": "SIGMA - Remote Thread Creation By Uncommon Source Image", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Perez Diego (@darkquassar), oscd.community"], "description": "Detects uncommon processes creating remote threads.", "rule_id": "66d31e5f-52d6-40a4-9615-002d3789a119", "false_positives": ["This rule is best put in testing first in order to create a baseline that reflects the data in your environment."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["Personal research, statistical analysis", "https://lolbas-project.github.io"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and ((SourceImage like~ (\"*\\\\explorer.exe\", \"*\\\\iexplore.exe\", \"*\\\\msiexec.exe\", \"*\\\\powerpnt.exe\", \"*\\\\schtasks.exe\", \"*\\\\winlogon.exe\")) and (not ((SourceImage:\"C:\\\\Windows\\\\System32\\\\winlogon.exe\" and (TargetImage like~ (\"C:\\\\Windows\\\\System32\\\\services.exe\", \"C:\\\\Windows\\\\System32\\\\wininit.exe\", \"C:\\\\Windows\\\\System32\\\\csrss.exe\", \"C:\\\\Windows\\\\System32\\\\LogonUI.exe\", \"C:\\\\Windows\\\\System32\\\\wlrmdr.exe\", \"C:\\\\Windows\\\\System32\\\\AtBroker.exe\", \"C:\\\\Windows\\\\System32\\\\dwm.exe\", \"C:\\\\Windows\\\\System32\\\\fontdrvhost.exe\", \"C:\\\\Windows\\\\System32\\\\userinit.exe\"))) or (SourceImage:\"C:\\\\Windows\\\\System32\\\\winlogon.exe\" and TargetParentProcessId:4) or ((SourceImage like~ (\"C:\\\\Windows\\\\System32\\\\schtasks.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\schtasks.exe\")) and TargetImage:\"C:\\\\Windows\\\\System32\\\\conhost.exe\") or (SourceImage:\"C:\\\\Windows\\\\explorer.exe\" and (TargetImage like~ (\"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Program Files\\\\*\", \"C:\\\\Windows\\\\System32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\"))) or TargetImage:\"System\" or (SourceImage:\"*\\\\msiexec.exe\" and (TargetImage like~ (\"*\\\\AppData\\\\Local\\\\*\", \"*C:\\\\Program Files (x86)\\\\*\", \"*C:\\\\Program Files\\\\*\", \"*C:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\*\"))) or (SourceImage:\"*\\\\msiexec.exe\" and (TargetImage like~ (\"C:\\\\Windows\\\\System32\\\\msiexec.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\"))) or (SourceImage:\"C:\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\" and (TargetImage like~ (\"C:\\\\Program Files (x86)\\\\Internet Explorer\\\\iexplore.exe\", \"C:\\\\Windows\\\\System32\\\\rundll32.exe\"))) or (SourceImage:\"*\\\\POWERPNT.EXE\" and (TargetImage like~ (\"*C:\\\\Program Files\\\\Microsoft Office\\\\*\", \"*C:\\\\Program Files (x86)\\\\Microsoft Office\\\\*\"))) or (?TargetImage == null) or TargetImage==\"\")) and (not ((SourceImage:\"C:\\\\Program Files\\\\internet explorer\\\\iexplore.exe\" and (SourceCommandLine:\"*https://*\" and SourceCommandLine:\"*.checkpoint.com/documents/*\" and SourceCommandLine:\"*SmartConsole_OLH/*\" and SourceCommandLine:\"*default.htm#cshid=*\")) or (SourceImage:\"C:\\\\Program Files\\\\internet explorer\\\\iexplore.exe\" and (SourceParentImage like~ (\"C:\\\\Program Files\\\\*\", \"C:\\\\Program Files (x86)\\\\*\")) and (SourceParentImage:\"*\\\\CheckPoint\\\\SmartConsole\\\\*\" and SourceParentImage:\"*\\\\SmartConsole.exe*\")) or (SourceImage:\"*\\\\Microsoft Office\\\\*\" and SourceImage:\"*\\\\POWERPNT.EXE\" and TargetImage:\"C:\\\\Windows\\\\System32\\\\csrss.exe\") or (SourceImage:\"C:\\\\Windows\\\\explorer.exe\" and TargetImage:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\OneDrive.exe\") or (SourceImage:\"C:\\\\Windows\\\\explorer.exe\" and TargetImage:\"*\\\\aurora-dashboard.exe\") or (SourceImage:\"C:\\\\Windows\\\\explorer.exe\" and TargetImage:\"*\\\\OfficeSetup.exe\"))))", "filters": [], "actions": []}
{"id": "a1a144b7-5c9b-4853-a559-2172be8d4a03", "name": "SIGMA - Remote Thread Creation In Uncommon Target Image", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects uncommon target processes for remote thread creation", "rule_id": "a1a144b7-5c9b-4853-a559-2172be8d4a03", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": [{"id": "T1055.003", "reference": "https://attack.mitre.org/techniques/T1055/003", "name": "Thread Execution Hijacking"}]}]}], "tags": [], "to": "now", "references": ["https://web.archive.org/web/20220319032520/https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and ((TargetImage like~ (\"*\\\\calc.exe\", \"*\\\\calculator.exe\", \"*\\\\mspaint.exe\", \"*\\\\notepad.exe\", \"*\\\\ping.exe\", \"*\\\\sethc.exe\", \"*\\\\spoolsv.exe\", \"*\\\\wordpad.exe\", \"*\\\\write.exe\")) and (not (SourceImage:\"C:\\\\Windows\\\\System32\\\\csrss.exe\" or ((SourceImage like~ (\"C:\\\\Windows\\\\System32\\\\explorer.exe\", \"C:\\\\Windows\\\\System32\\\\OpenWith.exe\")) and TargetImage:\"C:\\\\Windows\\\\System32\\\\notepad.exe\") or (SourceImage:\"C:\\\\Windows\\\\System32\\\\AtBroker.exe\" and TargetImage:\"C:\\\\Windows\\\\System32\\\\Sethc.exe\"))) and (not (StartFunction:\"EtwpNotificationThread\" or SourceImage:\"*unknown process*\" or (SourceImage:\"C:\\\\Program Files\\\\VMware\\\\VMware Tools\\\\vmtoolsd.exe\" and StartFunction:\"GetCommandLineW\" and (TargetImage like~ (\"C:\\\\Windows\\\\System32\\\\notepad.exe\", \"C:\\\\Windows\\\\System32\\\\spoolsv.exe\"))) or (SourceImage:\"C:\\\\Program Files\\\\Xerox\\\\XeroxPrintExperience\\\\CommonFiles\\\\XeroxPrintJobEventManagerService.exe\" and StartFunction:\"LoadLibraryW\" and TargetImage:\"C:\\\\Windows\\\\System32\\\\spoolsv.exe\"))))", "filters": [], "actions": []}
{"id": "c15e99a3-c474-48ab-b9a7-84549a7a9d16", "name": "SIGMA - Remote Thread Creation Ttdinject.exe Proxy", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Detects a remote thread creation of Ttdinject.exe used as proxy", "rule_id": "c15e99a3-c474-48ab-b9a7-84549a7a9d16", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1127", "reference": "https://attack.mitre.org/techniques/T1127", "name": "Trusted Developer Utilities Proxy Execution", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:8 and SourceImage:\"*\\\\ttdinject.exe\"", "filters": [], "actions": []}
