{"id": "aff715fa-4dd5-497a-8db3-910bea555566", "name": "SIGMA - DNS Query to External Service Interaction Domains", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems), Matt Kelly (list of domains)"], "description": "Detects suspicious DNS queries to external service interaction domains often used for out-of-band interactions after successful RCE", "rule_id": "aff715fa-4dd5-497a-8db3-910bea555566", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}, {"tactic": {"id": "TA0043", "reference": "https://attack.mitre.org/tactics/TA0043", "name": "Reconnaissance"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1595", "reference": "https://attack.mitre.org/techniques/T1595", "name": "Active Scanning", "subtechnique": [{"id": "T1595.002", "reference": "https://attack.mitre.org/techniques/T1595/002", "name": "Vulnerability Scanning"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/breakersall/status/1533493587828260866"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query like~ (\"*.interact.sh*\", \"*.oast.pro*\", \"*.oast.live*\", \"*.oast.site*\", \"*.oast.online*\", \"*.oast.fun*\", \"*.oast.me*\", \"*.burpcollaborator.net*\", \"*.oastify.com*\", \"*.canarytokens.com*\", \"*.requestbin.net*\", \"*.dnslog.cn*\")", "filters": [], "actions": []}
{"id": "2975af79-28c4-4d2f-a951-9095f229df29", "name": "SIGMA - Cobalt Strike DNS Beaconing", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects suspicious DNS queries known from Cobalt Strike beacons", "rule_id": "2975af79-28c4-4d2f-a951-9095f229df29", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.004", "reference": "https://attack.mitre.org/techniques/T1071/004", "name": "DNS"}]}]}], "tags": [], "to": "now", "references": ["https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns", "https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (query like~ (\"aaa.stage.*\", \"post.1*\")) or query:\"*.stage.123456.*\"", "filters": [], "actions": []}
{"id": "b593fd50-7335-4682-a36c-4edcb68e4641", "name": "SIGMA - Monero Crypto Coin Mining Pool Lookup", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects suspicious DNS queries to Monero mining pools", "rule_id": "b593fd50-7335-4682-a36c-4edcb68e4641", "false_positives": ["Legitimate crypto coin mining"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1496", "reference": "https://attack.mitre.org/techniques/T1496", "name": "Resource Hijacking", "subtechnique": []}]}, {"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1567", "reference": "https://attack.mitre.org/techniques/T1567", "name": "Exfiltration Over Web Service", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.nextron-systems.com/2021/10/24/monero-mining-pool-fqdns/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query like~ (\"*pool.minexmr.com*\", \"*fr.minexmr.com*\", \"*de.minexmr.com*\", \"*sg.minexmr.com*\", \"*ca.minexmr.com*\", \"*us-west.minexmr.com*\", \"*pool.supportxmr.com*\", \"*mine.c3pool.com*\", \"*xmr-eu1.nanopool.org*\", \"*xmr-eu2.nanopool.org*\", \"*xmr-us-east1.nanopool.org*\", \"*xmr-us-west1.nanopool.org*\", \"*xmr-asia1.nanopool.org*\", \"*xmr-jp1.nanopool.org*\", \"*xmr-au1.nanopool.org*\", \"*xmr.2miners.com*\", \"*xmr.hashcity.org*\", \"*xmr.f2pool.com*\", \"*xmrpool.eu*\", \"*pool.hashvault.pro*\")", "filters": [], "actions": []}
{"id": "4153a907-2451-4e4f-a578-c52bb6881432", "name": "SIGMA - Suspicious DNS Query with B64 Encoded String", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects suspicious DNS queries using base64 encoding", "rule_id": "4153a907-2451-4e4f-a578-c52bb6881432", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1048", "reference": "https://attack.mitre.org/techniques/T1048", "name": "Exfiltration Over Alternative Protocol", "subtechnique": [{"id": "T1048.003", "reference": "https://attack.mitre.org/techniques/T1048/003", "name": "Exfiltration Over Unencrypted Non-C2 Protocol"}]}]}, {"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.004", "reference": "https://attack.mitre.org/techniques/T1071/004", "name": "DNS"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/krmaxwell/dns-exfiltration"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query:\"*==.*\"", "filters": [], "actions": []}
{"id": "c64c5175-5189-431b-a55e-6d9882158251", "name": "SIGMA - Telegram Bot API Request", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects suspicious DNS queries to api.telegram.org used by Telegram Bots of any kind", "rule_id": "c64c5175-5189-431b-a55e-6d9882158251", "false_positives": ["Legitimate use of Telegram bots in the company"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1102", "reference": "https://attack.mitre.org/techniques/T1102", "name": "Web Service", "subtechnique": [{"id": "T1102.002", "reference": "https://attack.mitre.org/techniques/T1102/002", "name": "Bidirectional Communication"}]}]}], "tags": [], "to": "now", "references": ["https://core.telegram.org/bots/faq", "https://researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/", "https://blog.malwarebytes.com/threat-analysis/2016/11/telecrypt-the-ransomware-abusing-telegram-api-defeated/", "https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query:\"api.telegram.org\"", "filters": [], "actions": []}
{"id": "8ae51330-899c-4641-8125-e39f2e07da72", "name": "SIGMA - DNS TXT Answer with Possible Execution Strings", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Markus Neis"], "description": "Detects strings used in command execution in DNS TXT Answer", "rule_id": "8ae51330-899c-4641-8125-e39f2e07da72", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.004", "reference": "https://attack.mitre.org/techniques/T1071/004", "name": "DNS"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/stvemillertime/status/1024707932447854592", "https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Backdoors/DNS_TXT_Pwnage.ps1"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where record_type:\"TXT\" and (answer like~ (\"*IEX*\", \"*Invoke-Expression*\", \"*cmd.exe*\"))", "filters": [], "actions": []}
{"id": "3eaf6218-3bed-4d8a-8707-274096f12a18", "name": "SIGMA - Wannacry Killswitch Domain", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Mike Wade"], "description": "Detects wannacry killswitch domain dns queries", "rule_id": "3eaf6218-3bed-4d8a-8707-274096f12a18", "false_positives": ["Analyst testing"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.001", "reference": "https://attack.mitre.org/techniques/T1071/001", "name": "Web Protocols"}]}]}], "tags": [], "to": "now", "references": ["https://www.mandiant.com/resources/blog/wannacry-ransomware-campaign"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query like~ (\"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.testing\", \"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.test\", \"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.com\", \"ayylmaotjhsstasdfasdfasdfasdfasdfasdfasdf.com\", \"iuqssfsodp9ifjaposdfjhgosurijfaewrwergwea.com\")", "filters": [], "actions": []}
