{"id": "065cceea-77ec-4030-9052-fc0affea7110", "name": "SIGMA - DNS Query for Anonfiles.com Domain - Sysmon", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["pH-T (Nextron Systems)"], "description": "Detects DNS queries for \"anonfiles.com\", which is an anonymous file upload platform often used for malicious purposes", "rule_id": "065cceea-77ec-4030-9052-fc0affea7110", "false_positives": ["Rare legitimate access to anonfiles.com"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1567", "reference": "https://attack.mitre.org/techniques/T1567", "name": "Exfiltration Over Web Service", "subtechnique": [{"id": "T1567.002", "reference": "https://attack.mitre.org/techniques/T1567/002", "name": "Exfiltration to Cloud Storage"}]}]}], "tags": [], "to": "now", "references": ["https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and QueryName:\"*.anonfiles.com*\"", "filters": [], "actions": []}
{"id": "7cff77e1-9663-46a3-8260-17f2e1aa9d0a", "name": "SIGMA - AppX Package Installation Attempts Via AppInstaller.EXE", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Detects DNS queries made by \"AppInstaller.EXE\". The AppInstaller is the default handler for the \"ms-appinstaller\" URI. It attempts to load/install a package from the referenced URL\n", "rule_id": "7cff77e1-9663-46a3-8260-17f2e1aa9d0a", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1105", "reference": "https://attack.mitre.org/techniques/T1105", "name": "Ingress Tool Transfer", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://twitter.com/notwhickey/status/1333900137232523264", "https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (Image:\"C:\\\\Program Files\\\\WindowsApps\\\\Microsoft.DesktopAppInstaller_*\" and Image:\"*\\\\AppInstaller.exe\")", "filters": [], "actions": []}
{"id": "a1d9eec5-33b2-4177-8d24-27fe754d0812", "name": "SIGMA - Cloudflared Tunnels Related DNS Requests", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects DNS requests to Cloudflared tunnels domains.\nAttackers can abuse that feature to establish a reverse shell or persistence on a machine.\n", "rule_id": "a1d9eec5-33b2-4177-8d24-27fe754d0812", "false_positives": ["Legitimate use of cloudflare tunnels will also trigger this."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.001", "reference": "https://attack.mitre.org/techniques/T1071/001", "name": "Web Protocols"}]}]}], "tags": [], "to": "now", "references": ["https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/", "Internal Research"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName like~ (\"*.v2.argotunnel.com\", \"*protocol-v2.argotunnel.com\", \"*trycloudflare.com\", \"*update.argotunnel.com\"))", "filters": [], "actions": []}
{"id": "f8c1e80b-c73a-476a-ae24-6c72528b1521", "name": "SIGMA - DNS Query To Common Malware Hosting and Shortener Services", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Ahmed Nosir (@egycondor)"], "description": "Detects DNS queries to domains commonly used by threat actors to host malware payloads or redirect through URL shorteners.\nThese include platforms like Cloudflare Workers, TryCloudflare, InfinityFree, and URL shorteners such as tinyurl and lihi.cc.\nSuch DNS activity can indicate potential delivery or command-and-control communication attempts.\n", "rule_id": "f8c1e80b-c73a-476a-ae24-6c72528b1521", "false_positives": ["Legitimate use of these services is possible but rare in enterprise environments"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.004", "reference": "https://attack.mitre.org/techniques/T1071/004", "name": "DNS"}]}]}], "tags": [], "to": "now", "references": ["https://cloud.google.com/blog/topics/threat-intelligence/apt41-innovative-tactics"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName like~ (\"*msapp.workers.dev*\", \"*trycloudflare.com*\", \"*infinityfreeapp.com*\", \"*my5353.com*\", \"*reurl.cc*\", \"*lihi.cc*\", \"*tinyurl.com*\"))", "filters": [], "actions": []}
{"id": "1cb0c6ce-3d00-44fc-ab9c-6d6d577bf20b", "name": "SIGMA - DNS Query To Devtunnels Domain", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["citron_ninja"], "description": "Detects DNS query requests to Devtunnels domains. Attackers can abuse that feature to establish a reverse shell or persistence on a machine.\n", "rule_id": "1cb0c6ce-3d00-44fc-ab9c-6d6d577bf20b", "false_positives": ["Legitimate use of Devtunnels will also trigger this."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.001", "reference": "https://attack.mitre.org/techniques/T1071/001", "name": "Web Protocols"}]}]}], "tags": [], "to": "now", "references": ["https://blueteamops.medium.com/detecting-dev-tunnels-16f0994dc3e2", "https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/security", "https://cydefops.com/devtunnels-unleashed"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and QueryName:\"*.devtunnels.ms\"", "filters": [], "actions": []}
{"id": "a21bcd7e-38ec-49ad-b69a-9ea17e69509e", "name": "SIGMA - DNS Server Discovery Via LDAP Query", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Detects DNS server discovery via LDAP query requests from uncommon applications", "rule_id": "a21bcd7e-38ec-49ad-b69a-9ea17e69509e", "false_positives": ["Likely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1482", "reference": "https://attack.mitre.org/techniques/T1482", "name": "Domain Trust Discovery", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/redcanaryco/atomic-red-team/blob/980f3f83fd81f37c1ca9c02dccfd1c3d9f9d0841/atomics/T1016/T1016.md#atomic-test-9---dns-server-discovery-using-nslookup", "https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/7fcdce70-5205-44d6-9c3a-260e616a2f04"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName:\"_ldap.*\" and (not ((Image like~ (\"*:\\\\Program Files\\\\*\", \"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Windows\\\\*\")) or (Image:\"*:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\*\" and Image:\"*\\\\MsMpEng.exe\") or Image:\"<unknown process>\" or (?Image == null))) and (not (Image:\"C:\\\\WindowsAzure\\\\GuestAgent*\" or (Image like~ (\"*\\\\chrome.exe\", \"*\\\\firefox.exe\", \"*\\\\opera.exe\")))))", "filters": [], "actions": []}
{"id": "e043f529-8514-4205-8ab0-7f7d2927b400", "name": "SIGMA - DNS Query To AzureWebsites.NET By Non-Browser Process", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects a DNS query by a non browser process on the system to \"azurewebsites.net\". The latter was often used by threat actors as a malware hosting and exfiltration site.\n", "rule_id": "e043f529-8514-4205-8ab0-7f7d2927b400", "false_positives": ["Likely with other browser software. Apply additional filters for any other browsers you might use."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1219", "reference": "https://attack.mitre.org/techniques/T1219", "name": "Remote Access Tools", "subtechnique": [{"id": "T1219.002", "reference": "https://attack.mitre.org/techniques/T1219/002", "name": "Remote Desktop Software"}]}]}], "tags": [], "to": "now", "references": ["https://www.sentinelone.com/labs/wip26-espionage-threat-actors-abuse-cloud-infrastructure-in-targeted-telco-attacks/", "https://symantec-enterprise-blogs.security.com/threat-intelligence/harvester-new-apt-attacks-asia", "https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/", "https://intezer.com/blog/research/how-we-escaped-docker-in-azure-functions/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName:\"*azurewebsites.net\" and (not ((Image like~ (\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (Image like~ (\"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\")) or (Image like~ (\"C:\\\\Program Files (x86)\\\\Internet Explorer\\\\iexplore.exe\", \"C:\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\")) or (Image:\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\" or Image:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\" or (Image like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\", \"C:\\\\Program Files\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\"))) or ((Image like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeCore\\\\*\", \"C:\\\\Program Files\\\\Microsoft\\\\EdgeCore\\\\*\")) and (Image like~ (\"*\\\\msedge.exe\", \"*\\\\msedgewebview2.exe\"))) or Image:\"*\\\\safari.exe\" or (Image like~ (\"*\\\\MsMpEng.exe\", \"*\\\\MsSense.exe\")) or (Image:\"*\\\\brave.exe\" and Image:\"C:\\\\Program Files\\\\BraveSoftware\\\\*\") or (Image:\"*\\\\AppData\\\\Local\\\\Maxthon\\\\*\" and Image:\"*\\\\maxthon.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Programs\\\\Opera\\\\*\" and Image:\"*\\\\opera.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\SeaMonkey\\\\*\", \"C:\\\\Program Files (x86)\\\\SeaMonkey\\\\*\")) and Image:\"*\\\\seamonkey.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Vivaldi\\\\*\" and Image:\"*\\\\vivaldi.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\Naver\\\\Naver Whale\\\\*\", \"C:\\\\Program Files (x86)\\\\Naver\\\\Naver Whale\\\\*\")) and Image:\"*\\\\whale.exe\") or Image:\"*\\\\Tor Browser\\\\*\" or ((Image like~ (\"C:\\\\Program Files\\\\Waterfox\\\\*\", \"C:\\\\Program Files (x86)\\\\Waterfox\\\\*\")) and Image:\"*\\\\Waterfox.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Programs\\\\midori-ng\\\\*\" and Image:\"*\\\\Midori Next Generation.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\SlimBrowser\\\\*\", \"C:\\\\Program Files (x86)\\\\SlimBrowser\\\\*\")) and Image:\"*\\\\slimbrowser.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Flock\\\\*\" and Image:\"*\\\\Flock.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Phoebe\\\\*\" and Image:\"*\\\\Phoebe.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\Falkon\\\\*\", \"C:\\\\Program Files (x86)\\\\Falkon\\\\*\")) and Image:\"*\\\\falkon.exe\") or ((Image like~ (\"C:\\\\Program Files (x86)\\\\Avant Browser\\\\*\", \"C:\\\\Program Files\\\\Avant Browser\\\\*\")) and Image:\"*\\\\avant.exe\"))))", "filters": [], "actions": []}
{"id": "7bd3902d-8b8b-4dd4-838a-c6862d40150d", "name": "SIGMA - DNS HybridConnectionManager Service Bus", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)"], "description": "Detects Azure Hybrid Connection Manager services querying the Azure service bus service", "rule_id": "7bd3902d-8b8b-4dd4-838a-c6862d40150d", "false_positives": ["Legitimate use of Azure Hybrid Connection Manager and the Azure Service Bus service"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1554", "reference": "https://attack.mitre.org/techniques/T1554", "name": "Compromise Host Software Binary", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://twitter.com/Cyb3rWard0g/status/1381642789369286662"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName:\"*servicebus.windows.net*\" and Image:\"*HybridConnectionManager*\")", "filters": [], "actions": []}
{"id": "e7a21b5f-d8c4-4ae5-b8d9-93c5d3f28e1c", "name": "SIGMA - Suspicious DNS Query Indicating Kerberos Coercion via DNS Object SPN Spoofing", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Swachchhanda Shrawan Poudel (Nextron Systems)"], "description": "Detects DNS queries containing patterns associated with Kerberos coercion attacks via DNS object spoofing.\nThe pattern \"1UWhRCAAAAA..BAAAA\" is a base64-encoded signature that corresponds to a marshaled CREDENTIAL_TARGET_INFORMATION structure.\nAttackers can use this technique to coerce authentication from victim systems to attacker-controlled hosts.\nIt is one of the strong indicators of a Kerberos coercion attack, where adversaries manipulate DNS records\nto spoof Service Principal Names (SPNs) and redirect authentication requests like CVE-2025-33073.\n", "rule_id": "e7a21b5f-d8c4-4ae5-b8d9-93c5d3f28e1c", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1557", "reference": "https://attack.mitre.org/techniques/T1557", "name": "Adversary-in-the-Middle", "subtechnique": [{"id": "T1557.001", "reference": "https://attack.mitre.org/techniques/T1557/001", "name": "LLMNR/NBT-NS Poisoning and SMB Relay"}]}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1187", "reference": "https://attack.mitre.org/techniques/T1187", "name": "Forced Authentication", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025", "https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName:\"*UWhRCA*\" and QueryName:\"*BAAAA*\")", "filters": [], "actions": []}
{"id": "f356a9c4-effd-4608-bbf8-408afd5cd006", "name": "SIGMA - Suspicious Cobalt Strike DNS Beaconing - Sysmon", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects a program that invoked suspicious DNS queries known from Cobalt Strike beacons", "rule_id": "f356a9c4-effd-4608-bbf8-408afd5cd006", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.004", "reference": "https://attack.mitre.org/techniques/T1071/004", "name": "DNS"}]}]}], "tags": [], "to": "now", "references": ["https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns", "https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and ((QueryName like~ (\"aaa.stage.*\", \"post.1*\")) or QueryName:\"*.stage.123456.*\")", "filters": [], "actions": []}
{"id": "613c03ba-0779-4a53-8a1f-47f914a4ded3", "name": "SIGMA - DNS Query To MEGA Hosting Website", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Aaron Greetham (@beardofbinary) - NCC Group"], "description": "Detects DNS queries for subdomains related to MEGA sharing website", "rule_id": "613c03ba-0779-4a53-8a1f-47f914a4ded3", "false_positives": ["Legitimate DNS queries and usage of Mega"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1567", "reference": "https://attack.mitre.org/techniques/T1567", "name": "Exfiltration Over Web Service", "subtechnique": [{"id": "T1567.002", "reference": "https://attack.mitre.org/techniques/T1567/002", "name": "Exfiltration to Cloud Storage"}]}]}], "tags": [], "to": "now", "references": ["https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and QueryName:\"*userstorage.mega.co.nz*\"", "filters": [], "actions": []}
{"id": "df68f791-ad95-447f-a271-640a0dab9cf8", "name": "SIGMA - DNS Query Request To OneLaunch Update Service", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Josh Nickels"], "description": "Detects DNS query requests to \"update.onelaunch.com\". This domain is associated with the OneLaunch adware application.\nWhen the OneLaunch application is installed it will attempt to get updates from this domain.\n", "rule_id": "df68f791-ad95-447f-a271-640a0dab9cf8", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1056", "reference": "https://attack.mitre.org/techniques/T1056", "name": "Input Capture", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.malwarebytes.com/blog/detections/pup-optional-onelaunch-silentcf", "https://www.myantispyware.com/2020/12/14/how-to-uninstall-onelaunch-browser-removal-guide/", "https://malware.guide/browser-hijacker/remove-onelaunch-virus/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName:\"update.onelaunch.com\" and Image:\"*\\\\OneLaunch.exe\")", "filters": [], "actions": []}
{"id": "882e858a-3233-4ba8-855e-2f3d3575803d", "name": "SIGMA - DNS Query Request By QuickAssist.EXE", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Muhammad Faisal (@faisalusuf)"], "description": "Detects DNS queries initiated by \"QuickAssist.exe\" to Microsoft Quick Assist primary endpoint that is used to establish a session.\n", "rule_id": "882e858a-3233-4ba8-855e-2f3d3575803d", "false_positives": ["Legitimate use of Quick Assist in the environment."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.001", "reference": "https://attack.mitre.org/techniques/T1071/001", "name": "Web Protocols"}]}]}, {"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1210", "reference": "https://attack.mitre.org/techniques/T1210", "name": "Exploitation of Remote Services", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.microsoft.com/en-us/security/blog/2024/05/15/threat-actors-misusing-quick-assist-in-social-engineering-attacks-leading-to-ransomware/", "https://www.linkedin.com/posts/kevin-beaumont-security_ive-been-assisting-a-few-orgs-hit-with-successful-activity-7268055739116445701-xxjZ/", "https://x.com/cyb3rops/status/1862406110365245506", "https://learn.microsoft.com/en-us/windows/client-management/client-tools/quick-assist"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (Image:\"*\\\\QuickAssist.exe\" and QueryName:\"*remoteassistance.support.services.microsoft.com\")", "filters": [], "actions": []}
{"id": "36e037c4-c228-4866-b6a3-48eb292b9955", "name": "SIGMA - DNS Query Request By Regsvr32.EXE", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dmitriy Lifanov, oscd.community"], "description": "Detects DNS queries initiated by \"Regsvr32.exe\"", "rule_id": "36e037c4-c228-4866-b6a3-48eb292b9955", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1559", "reference": "https://attack.mitre.org/techniques/T1559", "name": "Inter-Process Communication", "subtechnique": [{"id": "T1559.001", "reference": "https://attack.mitre.org/techniques/T1559/001", "name": "Component Object Model"}]}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "reference": "https://attack.mitre.org/techniques/T1218", "name": "System Binary Proxy Execution", "subtechnique": [{"id": "T1218.010", "reference": "https://attack.mitre.org/techniques/T1218/010", "name": "Regsvr32"}]}]}], "tags": [], "to": "now", "references": ["https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/", "https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and Image:\"*\\\\regsvr32.exe\"", "filters": [], "actions": []}
{"id": "4d07b1f4-cb00-4470-b9f8-b0191d48ff52", "name": "SIGMA - DNS Query To Remote Access Software Domain From Non-Browser App", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113, Connor Martin"], "description": "An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.\nThese services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.\nRemote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)\n", "rule_id": "4d07b1f4-cb00-4470-b9f8-b0191d48ff52", "false_positives": ["Likely with other browser software. Apply additional filters for any other browsers you might use."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1219", "reference": "https://attack.mitre.org/techniques/T1219", "name": "Remote Access Tools", "subtechnique": [{"id": "T1219.002", "reference": "https://attack.mitre.org/techniques/T1219/002", "name": "Remote Desktop Software"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-4---gotoassist-files-detected-test-on-windows", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-3---logmein-files-detected-test-on-windows", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-6---ammyy-admin-software-execution", "https://redcanary.com/blog/misbehaving-rats/", "https://techcommunity.microsoft.com/t5/microsoft-sentinel-blog/hunting-for-omi-vulnerability-exploitation-with-azure-sentinel/ba-p/2764093", "https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-320a", "https://blog.sekoia.io/scattered-spider-laying-new-eggs/", "https://learn.microsoft.com/en-us/windows/client-management/client-tools/quick-assist#disable-quick-assist-within-your-organization"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (((QueryName like~ (\"*agent.jumpcloud.com\", \"*agentreporting.atera.com\", \"*ammyy.com\", \"*api.parsec.app\", \"*api.playanext.com\", \"*api.splashtop.com\", \"*app.atera.com\", \"*assist.zoho.com\", \"*authentication.logmeininc.com\", \"*beyondtrustcloud.com\", \"*cdn.kaseya.net\", \"*client.teamviewer.com\", \"*comserver.corporate.beanywhere.com\", \"*control.connectwise.com\", \"*downloads.zohocdn.com\", \"*dwservice.net\", \"*express.gotoassist.com\", \"*getgo.com\", \"*getscreen.me\", \"*integratedchat.teamviewer.com\", \"*join.zoho.com\", \"*kickstart.jumpcloud.com\", \"*license.bomgar.com\", \"*logmein-gateway.com\", \"*logmein.com\", \"*logmeincdn.http.internapcdn.net\", \"*n-able.com\", \"*net.anydesk.com\", \"*netsupportsoftware.com\", \"*parsecusercontent.com\", \"*pubsub.atera.com\", \"*relay.kaseya.net\", \"*relay.screenconnect.com\", \"*relay.splashtop.com\", \"*remoteassistance.support.services.microsoft.com\", \"*remotedesktop-pa.googleapis.com\", \"*remoteutilities.com\", \"*secure.logmeinrescue.com\", \"*services.vnc.com\", \"*static.remotepc.com\", \"*swi-rc.com\", \"*swi-tc.com\", \"*tailscale.com\", \"*telemetry.servers.qetqo.com\", \"*tmate.io\", \"*twingate.com\", \"*zohoassist.com\")) or (QueryName:\"*.rustdesk.com\" and QueryName:\"rs-*\")) and (not ((Image like~ (\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (Image like~ (\"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\")) or (Image like~ (\"C:\\\\Program Files (x86)\\\\Internet Explorer\\\\iexplore.exe\", \"C:\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\")) or (Image:\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\" or Image:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\" or (Image like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\", \"C:\\\\Program Files\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\"))) or ((Image like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeCore\\\\*\", \"C:\\\\Program Files\\\\Microsoft\\\\EdgeCore\\\\*\")) and (Image like~ (\"*\\\\msedge.exe\", \"*\\\\msedgewebview2.exe\"))) or Image:\"*\\\\safari.exe\" or (Image like~ (\"*\\\\MsMpEng.exe\", \"*\\\\MsSense.exe\")) or (Image:\"*\\\\brave.exe\" and Image:\"C:\\\\Program Files\\\\BraveSoftware\\\\*\") or (Image:\"*\\\\AppData\\\\Local\\\\Maxthon\\\\*\" and Image:\"*\\\\maxthon.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Programs\\\\Opera\\\\*\" and Image:\"*\\\\opera.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\SeaMonkey\\\\*\", \"C:\\\\Program Files (x86)\\\\SeaMonkey\\\\*\")) and Image:\"*\\\\seamonkey.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Vivaldi\\\\*\" and Image:\"*\\\\vivaldi.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\Naver\\\\Naver Whale\\\\*\", \"C:\\\\Program Files (x86)\\\\Naver\\\\Naver Whale\\\\*\")) and Image:\"*\\\\whale.exe\") or Image:\"*\\\\Tor Browser\\\\*\" or ((Image like~ (\"C:\\\\Program Files\\\\Waterfox\\\\*\", \"C:\\\\Program Files (x86)\\\\Waterfox\\\\*\")) and Image:\"*\\\\Waterfox.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Programs\\\\midori-ng\\\\*\" and Image:\"*\\\\Midori Next Generation.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\SlimBrowser\\\\*\", \"C:\\\\Program Files (x86)\\\\SlimBrowser\\\\*\")) and Image:\"*\\\\slimbrowser.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Flock\\\\*\" and Image:\"*\\\\Flock.exe\") or (Image:\"*\\\\AppData\\\\Local\\\\Phoebe\\\\*\" and Image:\"*\\\\Phoebe.exe\") or ((Image like~ (\"C:\\\\Program Files\\\\Falkon\\\\*\", \"C:\\\\Program Files (x86)\\\\Falkon\\\\*\")) and Image:\"*\\\\falkon.exe\") or ((Image like~ (\"C:\\\\Program Files (x86)\\\\Avant Browser\\\\*\", \"C:\\\\Program Files\\\\Avant Browser\\\\*\")) and Image:\"*\\\\avant.exe\"))))", "filters": [], "actions": []}
{"id": "ec82e2a5-81ea-4211-a1f8-37a0286df2c2", "name": "SIGMA - Suspicious DNS Query for IP Lookup Service APIs", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Brandon George (blog post), Thomas Patzke"], "description": "Detects DNS queries for IP lookup services such as \"api.ipify.org\" originating from a non browser process.", "rule_id": "ec82e2a5-81ea-4211-a1f8-37a0286df2c2", "false_positives": ["Legitimate usage of IP lookup services such as ipify API"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0043", "reference": "https://attack.mitre.org/tactics/TA0043", "name": "Reconnaissance"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1590", "reference": "https://attack.mitre.org/techniques/T1590", "name": "Gather Victim Network Information", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.binarydefense.com/analysis-of-hancitor-when-boring-begets-beacon", "https://twitter.com/neonprimetime/status/1436376497980428318", "https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (((QueryName like~ (\"www.ip.cn\", \"l2.io\")) or (QueryName like~ (\"*api.2ip.ua*\", \"*api.bigdatacloud.net*\", \"*api.ipify.org*\", \"*bot.whatismyipaddress.com*\", \"*canireachthe.net*\", \"*checkip.amazonaws.com*\", \"*checkip.dyndns.org*\", \"*curlmyip.com*\", \"*db-ip.com*\", \"*edns.ip-api.com*\", \"*eth0.me*\", \"*freegeoip.app*\", \"*geoipy.com*\", \"*getip.pro*\", \"*icanhazip.com*\", \"*ident.me*\", \"*ifconfig.io*\", \"*ifconfig.me*\", \"*ip-api.com*\", \"*ip.360.cn*\", \"*ip.anysrc.net*\", \"*ip.taobao.com*\", \"*ip.tyk.nu*\", \"*ipaddressworld.com*\", \"*ipapi.co*\", \"*ipconfig.io*\", \"*ipecho.net*\", \"*ipinfo.io*\", \"*ipip.net*\", \"*ipof.in*\", \"*ipv4.icanhazip.com*\", \"*ipv4bot.whatismyipaddress.com*\", \"*ipv6-test.com*\", \"*ipwho.is*\", \"*jsonip.com*\", \"*myexternalip.com*\", \"*seeip.org*\", \"*wgetip.com*\", \"*whatismyip.akamai.com*\", \"*whois.pconline.com.cn*\", \"*wtfismyip.com*\"))) and (not (Image:\"*\\\\brave.exe\" or (Image like~ (\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (Image like~ (\"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\")) or (Image like~ (\"C:\\\\Program Files (x86)\\\\Internet Explorer\\\\iexplore.exe\", \"C:\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\")) or Image:\"*\\\\maxthon.exe\" or (Image:\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\" or Image:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\" or (Image like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\", \"C:\\\\Program Files\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\"))) or ((Image like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeCore\\\\*\", \"C:\\\\Program Files\\\\Microsoft\\\\EdgeCore\\\\*\")) and (Image like~ (\"*\\\\msedge.exe\", \"*\\\\msedgewebview2.exe\"))) or Image:\"*\\\\opera.exe\" or Image:\"*\\\\safari.exe\" or Image:\"*\\\\seamonkey.exe\" or Image:\"*\\\\vivaldi.exe\" or Image:\"*\\\\whale.exe\")))", "filters": [], "actions": []}
{"id": "778ba9a8-45e4-4b80-8e3e-34a419f0b85e", "name": "SIGMA - TeamViewer Domain Query By Non-TeamViewer Application", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects DNS queries to a TeamViewer domain only resolved by a TeamViewer client by an image that isn't named TeamViewer (sometimes used by threat actors for obfuscation)", "rule_id": "778ba9a8-45e4-4b80-8e3e-34a419f0b85e", "false_positives": ["Unknown binary names of TeamViewer", "Depending on the environment the rule might require some initial tuning before usage to avoid FP with third party applications"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1219", "reference": "https://attack.mitre.org/techniques/T1219", "name": "Remote Access Tools", "subtechnique": [{"id": "T1219.002", "reference": "https://attack.mitre.org/techniques/T1219/002", "name": "Remote Desktop Software"}]}]}], "tags": [], "to": "now", "references": ["https://www.teamviewer.com/en-us/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and ((QueryName like~ (\"taf.teamviewer.com\", \"udp.ping.teamviewer.com\")) and (not Image:\"*TeamViewer*\"))", "filters": [], "actions": []}
{"id": "b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544", "name": "SIGMA - DNS Query Tor .Onion Address - Sysmon", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Detects DNS queries to an \".onion\" address related to Tor routing networks", "rule_id": "b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1090", "reference": "https://attack.mitre.org/techniques/T1090", "name": "Proxy", "subtechnique": [{"id": "T1090.003", "reference": "https://attack.mitre.org/techniques/T1090/003", "name": "Multi-hop Proxy"}]}]}], "tags": [], "to": "now", "references": ["https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/", "https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/ASimDNS/imDNS_TorProxies.yaml"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and (QueryName like~ (\"*.hiddenservice.net\", \"*.onion.ca\", \"*.onion.cab\", \"*.onion.casa\", \"*.onion.city\", \"*.onion.direct\", \"*.onion.dog\", \"*.onion.glass\", \"*.onion.gq\", \"*.onion.ink\", \"*.onion.it\", \"*.onion.link\", \"*.onion.lt\", \"*.onion.lu\", \"*.onion.nu\", \"*.onion.pet\", \"*.onion.plus\", \"*.onion.rip\", \"*.onion.sh\", \"*.onion.to\", \"*.onion.top\", \"*.onion\", \"*.s1.tor-gateways.de\", \"*.s2.tor-gateways.de\", \"*.s3.tor-gateways.de\", \"*.s4.tor-gateways.de\", \"*.s5.tor-gateways.de\", \"*.t2w.pw\", \"*.tor2web.ae.org\", \"*.tor2web.blutmagie.de\", \"*.tor2web.com\", \"*.tor2web.fi\", \"*.tor2web.io\", \"*.tor2web.org\", \"*.tor2web.xyz\", \"*.torlink.co\"))", "filters": [], "actions": []}
{"id": "1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b", "name": "SIGMA - DNS Query To Ufile.io", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["yatinwad, TheDFIRReport"], "description": "Detects DNS queries to \"ufile.io\", which was seen abused by malware and threat actors as a method for data exfiltration", "rule_id": "1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b", "false_positives": ["DNS queries for \"ufile\" are not malicious by nature necessarily. Investigate the source to determine the necessary actions to take"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1567", "reference": "https://attack.mitre.org/techniques/T1567", "name": "Exfiltration Over Web Service", "subtechnique": [{"id": "T1567.002", "reference": "https://attack.mitre.org/techniques/T1567/002", "name": "Exfiltration to Cloud Storage"}]}]}], "tags": [], "to": "now", "references": ["https://thedfirreport.com/2021/12/13/diavol-ransomware/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and QueryName:\"*ufile.io*\"", "filters": [], "actions": []}
{"id": "b3e6418f-7c7a-4fad-993a-93b65027a9f1", "name": "SIGMA - DNS Query To Visual Studio Code Tunnels Domain", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["citron_ninja"], "description": "Detects DNS query requests to Visual Studio Code tunnel domains. Attackers can abuse that feature to establish a reverse shell or persistence on a machine.\n", "rule_id": "b3e6418f-7c7a-4fad-993a-93b65027a9f1", "false_positives": ["Legitimate use of Visual Studio Code tunnel will also trigger this."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1071", "reference": "https://attack.mitre.org/techniques/T1071", "name": "Application Layer Protocol", "subtechnique": [{"id": "T1071.001", "reference": "https://attack.mitre.org/techniques/T1071/001", "name": "Web Protocols"}]}]}], "tags": [], "to": "now", "references": ["https://ipfyx.fr/post/visual-studio-code-tunnel/", "https://badoption.eu/blog/2023/01/31/code_c2.html", "https://cydefops.com/vscode-data-exfiltration"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:22 and QueryName:\"*.tunnels.api.visualstudio.com\"", "filters": [], "actions": []}
