{"id": "a7c0ae48-8df8-42bf-91bd-2ea57e2f9d43", "name": "SIGMA - Juniper BGP Missing MD5", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Tim Brown"], "description": "Detects juniper BGP missing MD5 digest. Which may be indicative of brute force attacks to manipulate routing.", "rule_id": "a7c0ae48-8df8-42bf-91bd-2ea57e2f9d43", "false_positives": ["Unlikely. Except due to misconfigurations"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "reference": "https://attack.mitre.org/techniques/T1078", "name": "Valid Accounts", "subtechnique": []}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1110", "reference": "https://attack.mitre.org/techniques/T1110", "name": "Brute Force", "subtechnique": []}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1557", "reference": "https://attack.mitre.org/techniques/T1557", "name": "Adversary-in-the-Middle", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \":179\" and \"missing MD5 digest\"", "filters": [], "actions": []}
