{"id": "59ec40bb-322e-40ab-808d-84fa690d7e56", "name": "SIGMA - Nginx Core Dump", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects a core dump of a crashing Nginx worker process, which could be a signal of a serious problem or exploitation attempts.", "rule_id": "59ec40bb-322e-40ab-808d-84fa690d7e56", "false_positives": ["Serious issues with a configuration or plugin"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1499", "reference": "https://attack.mitre.org/techniques/T1499", "name": "Endpoint Denial of Service", "subtechnique": [{"id": "T1499.004", "reference": "https://attack.mitre.org/techniques/T1499/004", "name": "Application or System Exploitation"}]}]}], "tags": [], "to": "now", "references": ["https://docs.nginx.com/nginx/admin-guide/monitoring/debugging/#enabling-core-dumps", "https://www.x41-dsec.de/lab/advisories/x41-2021-002-nginx-resolver-copy/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"exited on signal 6 (core dumped)\"", "filters": [], "actions": []}
