{"id": "1ea13e8c-03ea-409b-877d-ce5c3d2c1cb3", "name": "SIGMA - ADFS Database Named Pipe Connection By Uncommon Tool", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "description": "Detects suspicious local connections via a named pipe to the AD FS configuration database (Windows Internal Database).\nUsed to access information such as the AD FS configuration settings which contains sensitive information used to sign SAML tokens.\n", "rule_id": "1ea13e8c-03ea-409b-877d-ce5c3d2c1cb3", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1005", "reference": "https://attack.mitre.org/techniques/T1005", "name": "Data from Local System", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/SecurityEvent/ADFSDBNamedPipeConnection.yaml", "https://o365blog.com/post/adfs/", "https://github.com/Azure/SimuLand"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and (PipeName:\"\\\\MICROSOFT##WID\\\\tsql\\\\query\" and (not (Image like~ (\"*:\\\\Windows\\\\System32\\\\mmc.exe\", \"*:\\\\Windows\\\\system32\\\\svchost.exe\", \"*:\\\\Windows\\\\System32\\\\wsmprovhost.exe\", \"*:\\\\Windows\\\\SysWOW64\\\\mmc.exe\", \"*:\\\\Windows\\\\SysWOW64\\\\wsmprovhost.exe\", \"*:\\\\Windows\\\\WID\\\\Binn\\\\sqlwriter.exe\", \"*\\\\AzureADConnect.exe\", \"*\\\\Microsoft.Identity.Health.Adfs.PshSurrogate.exe\", \"*\\\\Microsoft.IdentityServer.ServiceHost.exe\", \"*\\\\Microsoft.Tri.Sensor.exe\", \"*\\\\sqlservr.exe\", \"*\\\\tssdis.exe\"))))", "filters": [], "actions": []}
{"id": "d5601f8c-b26f-4ab0-9035-69e11a8d4ad2", "name": "SIGMA - CobaltStrike Named Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems), Wojciech Lesicki"], "description": "Detects the creation of a named pipe as used by CobaltStrike", "rule_id": "d5601f8c-b26f-4ab0-9035-69e11a8d4ad2", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://twitter.com/d4rksystem/status/1357010969264873472", "https://labs.f-secure.com/blog/detecting-cobalt-strike-default-modules-via-named-pipe-analysis/", "https://github.com/SigmaHQ/sigma/issues/253", "https://blog.cobaltstrike.com/2021/02/09/learn-pipe-fitting-for-all-of-your-offense-projects/", "https://redcanary.com/threat-detection-report/threats/cobalt-strike/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and ((PipeName:\"*\\\\MSSE-*\" and PipeName:\"*-server*\") or PipeName:\"\\\\postex_*\" or PipeName:\"\\\\status_*\" or PipeName:\"\\\\msagent_*\" or PipeName:\"\\\\mojo_*\" or PipeName:\"\\\\interprocess_*\" or PipeName:\"\\\\samr_*\" or PipeName:\"\\\\netlogon_*\" or PipeName:\"\\\\srvsvc_*\" or PipeName:\"\\\\lsarpc_*\" or PipeName:\"\\\\wkssvc_*\")", "filters": [], "actions": []}
{"id": "0e7163d4-9e19-4fa7-9be6-000c61aad77a", "name": "SIGMA - CobaltStrike Named Pipe Pattern Regex", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects the creation of a named pipe matching a pattern used by CobaltStrike Malleable C2 profiles", "rule_id": "0e7163d4-9e19-4fa7-9be6-000c61aad77a", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575", "https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and (PipeName regex~ \"\\\\mojo\\.5688\\.8052\\.(?:183894939787088877|35780273329370473)[0-9a-f]{2}\" or PipeName regex~ \"\\\\wkssvc_?[0-9a-f]{2}\" or PipeName regex~ \"\\\\ntsvcs[0-9a-f]{2}\" or PipeName regex~ \"\\\\DserNamePipe[0-9a-f]{2}\" or PipeName regex~ \"\\\\SearchTextHarvester[0-9a-f]{2}\" or PipeName regex~ \"\\\\mypipe-(?:f|h)[0-9a-f]{2}\" or PipeName regex~ \"\\\\windows\\.update\\.manager[0-9a-f]{2,3}\" or PipeName regex~ \"\\\\ntsvcs_[0-9a-f]{2}\" or PipeName regex~ \"\\\\scerpc_?[0-9a-f]{2}\" or PipeName regex~ \"\\\\PGMessagePipe[0-9a-f]{2}\" or PipeName regex~ \"\\\\MsFteWds[0-9a-f]{2}\" or PipeName regex~ \"\\\\f4c3[0-9a-f]{2}\" or PipeName regex~ \"\\\\fullduplex_[0-9a-f]{2}\" or PipeName regex~ \"\\\\msrpc_[0-9a-f]{4}\" or PipeName regex~ \"\\\\win\\\\msrpc_[0-9a-f]{2}\" or PipeName regex~ \"\\\\f53f[0-9a-f]{2}\" or PipeName regex~ \"\\\\rpc_[0-9a-f]{2}\" or PipeName regex~ \"\\\\spoolss_[0-9a-f]{2}\" or PipeName regex~ \"\\\\Winsock2\\\\CatalogChangeListener-[0-9a-f]{3}-0,\")", "filters": [], "actions": []}
{"id": "85adeb13-4fc9-4e68-8a4a-c7cb2c336eb7", "name": "SIGMA - CobaltStrike Named Pipe Patterns", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems), Christian Burkard (Nextron Systems)"], "description": "Detects the creation of a named pipe with a pattern found in CobaltStrike malleable C2 profiles", "rule_id": "85adeb13-4fc9-4e68-8a4a-c7cb2c336eb7", "false_positives": ["Chrome instances using the exact same pipe name \"mojo.xxx\"", "Websense Endpoint using the pipe name \"DserNamePipe(R|W)\\d{1,5}\""], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": ["stp-1k"], "to": "now", "references": ["https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575", "https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and ((((PipeName like~ (\"\\\\DserNamePipe*\", \"\\\\f4c3*\", \"\\\\f53f*\", \"\\\\fullduplex_*\", \"\\\\mojo.5688.8052.183894939787088877*\", \"\\\\mojo.5688.8052.35780273329370473*\", \"\\\\MsFteWds*\", \"\\\\msrpc_*\", \"\\\\mypipe-f*\", \"\\\\mypipe-h*\", \"\\\\ntsvcs*\", \"\\\\PGMessagePipe*\", \"\\\\rpc_*\", \"\\\\scerpc*\", \"\\\\SearchTextHarvester*\", \"\\\\spoolss*\", \"\\\\win_svc*\", \"\\\\win\\\\msrpc_*\", \"\\\\windows.update.manager*\", \"\\\\wkssvc*\")) or (PipeName like~ (\"\\\\demoagent_11\", \"\\\\demoagent_22\"))) or (PipeName:\"\\\\Winsock2\\\\CatalogChangeListener-*\" and PipeName:\"*-0,\")) and (not (PipeName like~ (\"\\\\wkssvc\", \"\\\\spoolss\", \"\\\\scerpc\", \"\\\\ntsvcs\", \"\\\\SearchTextHarvester\", \"\\\\PGMessagePipe\", \"\\\\MsFteWds\"))) and (not ((Image like~ (\"*:\\\\Program Files\\\\Websense\\\\*\", \"*:\\\\Program Files (x86)\\\\Websense\\\\*\")) and (PipeName like~ (\"\\\\DserNamePipeR*\", \"\\\\DserNamePipeW*\")))))", "filters": [], "actions": []}
{"id": "4d0083b3-580b-40da-9bba-626c19fe4033", "name": "SIGMA - HackTool - CoercedPotato Named Pipe Creation", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects the pattern of a pipe name as used by the hack tool CoercedPotato", "rule_id": "4d0083b3-580b-40da-9bba-626c19fe4033", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://blog.hackvens.fr/articles/CoercedPotato.html", "https://github.com/hackvens/CoercedPotato"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and PipeName:\"*\\\\coerced\\\\*\"", "filters": [], "actions": []}
{"id": "1f7025a6-e747-4130-aac4-961eb47015f1", "name": "SIGMA - HackTool - DiagTrackEoP Default Named Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects creation of default named pipe used by the DiagTrackEoP POC, a tool that abuses \"SeImpersonate\" privilege.", "rule_id": "1f7025a6-e747-4130-aac4-961eb47015f1", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-privilege-escalation"], "to": "now", "references": ["https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L22"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and PipeName:\"*thisispipe*\"", "filters": [], "actions": []}
{"id": "637f689e-b4a5-4a86-be0e-0100a0a33ba2", "name": "SIGMA - HackTool - EfsPotato Named Pipe Creation", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects the pattern of a pipe name as used by the hack tool EfsPotato", "rule_id": "637f689e-b4a5-4a86-be0e-0100a0a33ba2", "false_positives": ["\\pipe\\LOCAL\\Monitorian"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://twitter.com/SBousseaden/status/1429530155291193354?s=20", "https://github.com/zcgonvh/EfsPotato"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and ((PipeName like~ (\"*\\\\pipe\\\\*\", \"*\\\\pipe\\\\srvsvc*\")) and (not (PipeName like~ (\"*\\\\CtxShare*\", \"\\\\pipe\\\\*\"))))", "filters": [], "actions": []}
{"id": "961d0ba2-3eea-4303-a930-2cf78bbfcc5e", "name": "SIGMA - HackTool - Credential Dumping Tools Named Pipe Created", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Teymur Kheirkhabarov, oscd.community"], "description": "Detects well-known credential dumping tools execution via specific named pipe creation", "rule_id": "961d0ba2-3eea-4303-a930-2cf78bbfcc5e", "false_positives": ["Legitimate Administrator using tool for password recovery"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "https://image.slidesharecdn.com/zeronights2017kheirkhabarov-171118103000/75/hunting-for-credentials-dumping-in-windows-environment-57-2048.jpg?cb=1666035799"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and (PipeName like~ (\"*\\\\cachedump*\", \"*\\\\lsadump*\", \"*\\\\wceservicepipe*\"))", "filters": [], "actions": []}
{"id": "0adc67e0-a68f-4ffd-9c43-28905aad5d6a", "name": "SIGMA - HackTool - Koh Default Named Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects creation of default named pipes used by the Koh tool", "rule_id": "0adc67e0-a68f-4ffd-9c43-28905aad5d6a", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1528", "reference": "https://attack.mitre.org/techniques/T1528", "name": "Steal Application Access Token", "subtechnique": []}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "reference": "https://attack.mitre.org/techniques/T1134", "name": "Access Token Manipulation", "subtechnique": [{"id": "T1134.001", "reference": "https://attack.mitre.org/techniques/T1134/001", "name": "Token Impersonation/Theft"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/GhostPack/Koh/blob/0283d9f3f91cf74732ad377821986cfcb088e20a/Clients/BOF/KohClient.c#L12"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and (PipeName like~ (\"*\\\\imposecost*\", \"*\\\\imposingcost*\"))", "filters": [], "actions": []}
{"id": "58cb02d5-78ce-4692-b3e1-dce850aae41a", "name": "SIGMA - Alternate PowerShell Hosts Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Roberto Rodriguez @Cyb3rWard0g, Tim Shelton"], "description": "Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe", "rule_id": "58cb02d5-78ce-4692-b3e1-dce850aae41a", "false_positives": ["Programs using PowerShell directly without invocation of a dedicated interpreter."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "reference": "https://attack.mitre.org/techniques/T1059", "name": "Command and Scripting Interpreter", "subtechnique": [{"id": "T1059.001", "reference": "https://attack.mitre.org/techniques/T1059/001", "name": "PowerShell"}]}]}], "tags": [], "to": "now", "references": ["https://threathunterplaybook.com/hunts/windows/190610-PwshAlternateHosts/notebook.html", "https://threathunterplaybook.com/hunts/windows/190410-LocalPwshExecution/notebook.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and (PipeName:\"\\\\PSHost*\" and (not (((Image like~ (\"*:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe*\", \"*:\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe*\", \"*:\\\\Windows\\\\system32\\\\dsac.exe*\", \"*:\\\\Windows\\\\system32\\\\inetsrv\\\\w3wp.exe*\", \"*:\\\\Windows\\\\System32\\\\sdiagnhost.exe*\", \"*:\\\\Windows\\\\system32\\\\ServerManager.exe*\", \"*:\\\\Windows\\\\system32\\\\wbem\\\\wmiprvse.exe*\", \"*:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe*\", \"*:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe*\", \"*:\\\\Windows\\\\System32\\\\wsmprovhost.exe*\", \"*:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe*\", \"*:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe*\")) or (Image:\"*C:\\\\Program Files\\\\WindowsApps\\\\Microsoft.PowerShellPreview*\" and Image:\"*\\\\pwsh.exe*\") or (Image:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\WindowsApps\\\\Microsoft.PowerShellPreview*\" and Image:\"*\\\\pwsh.exe*\")) or (?Image == null))) and (not (((Image like~ (\"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Program Files\\\\*\")) and Image:\"*\\\\Microsoft SQL Server\\\\*\" and Image:\"*\\\\Tools\\\\Binn\\\\SQLPS.exe\") or (Image:\"C:\\\\Program Files\\\\AzureConnectedMachineAgent\\\\GCArcService*\" and Image:\"*\\\\GC\\\\gc_worker.exe\") or Image:\"C:\\\\Program Files\\\\Citrix\\\\*\" or Image:\"C:\\\\Program Files\\\\Microsoft\\\\Exchange Server\\\\*\")))", "filters": [], "actions": []}
{"id": "ac7102b4-9e1e-4802-9b4f-17c5524c015c", "name": "SIGMA - New PowerShell Instance Created", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)"], "description": "Detects the execution of PowerShell via the creation of a named pipe starting with PSHost", "rule_id": "ac7102b4-9e1e-4802-9b4f-17c5524c015c", "false_positives": ["Likely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 0, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "reference": "https://attack.mitre.org/techniques/T1059", "name": "Command and Scripting Interpreter", "subtechnique": [{"id": "T1059.001", "reference": "https://attack.mitre.org/techniques/T1059/001", "name": "PowerShell"}]}]}], "tags": [], "to": "now", "references": ["https://threathunterplaybook.com/hunts/windows/190610-PwshAlternateHosts/notebook.html", "https://threathunterplaybook.com/hunts/windows/190410-LocalPwshExecution/notebook.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and PipeName:\"\\\\PSHost*\"", "filters": [], "actions": []}
{"id": "f318b911-ea88-43f4-9281-0de23ede628e", "name": "SIGMA - PUA - CSExec Default Named Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nikita Nazarov, oscd.community, Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects default CSExec pipe creation", "rule_id": "f318b911-ea88-43f4-9281-0de23ede628e", "false_positives": ["Legitimate Administrator activity"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.002", "reference": "https://attack.mitre.org/techniques/T1021/002", "name": "SMB/Windows Admin Shares"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "reference": "https://attack.mitre.org/techniques/T1569", "name": "System Services", "subtechnique": [{"id": "T1569.002", "reference": "https://attack.mitre.org/techniques/T1569/002", "name": "Service Execution"}]}]}], "tags": [], "to": "now", "references": ["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view", "https://github.com/malcomvetter/CSExec"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and PipeName:\"*\\\\csexecsvc*\"", "filters": [], "actions": []}
{"id": "f6451de4-df0a-41fa-8d72-b39f54a08db5", "name": "SIGMA - PUA - PAExec Default Named Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects PAExec default named pipe", "rule_id": "f6451de4-df0a-41fa-8d72-b39f54a08db5", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "reference": "https://attack.mitre.org/techniques/T1569", "name": "System Services", "subtechnique": [{"id": "T1569.002", "reference": "https://attack.mitre.org/techniques/T1569/002", "name": "Service Execution"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Command%20and%20Control/C2-NamedPipe.md", "https://github.com/poweradminllc/PAExec"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and PipeName:\"\\\\PAExec*\"", "filters": [], "actions": []}
{"id": "d36f87ea-c403-44d2-aa79-1a0ac7c24456", "name": "SIGMA - PUA - RemCom Default Named Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nikita Nazarov, oscd.community, Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects default RemCom pipe creation", "rule_id": "d36f87ea-c403-44d2-aa79-1a0ac7c24456", "false_positives": ["Legitimate Administrator activity"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.002", "reference": "https://attack.mitre.org/techniques/T1021/002", "name": "SMB/Windows Admin Shares"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "reference": "https://attack.mitre.org/techniques/T1569", "name": "System Services", "subtechnique": [{"id": "T1569.002", "reference": "https://attack.mitre.org/techniques/T1569/002", "name": "Service Execution"}]}]}], "tags": [], "to": "now", "references": ["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view", "https://github.com/kavika13/RemCom"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and PipeName:\"*\\\\RemCom*\"", "filters": [], "actions": []}
{"id": "493fb4ab-cdcc-4c4f-818c-0e363bd1e4bb", "name": "SIGMA - WMI Event Consumer Created Named Pipe", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects the WMI Event Consumer service scrcons.exe creating a named pipe", "rule_id": "493fb4ab-cdcc-4c4f-818c-0e363bd1e4bb", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "reference": "https://attack.mitre.org/techniques/T1047", "name": "Windows Management Instrumentation", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/RiccardoAncarani/LiquidSnake"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and Image:\"*\\\\scrcons.exe\"", "filters": [], "actions": []}
{"id": "fe3ac066-98bb-432a-b1e7-a5229cb39d4a", "name": "SIGMA - Malicious Named Pipe Created", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems), blueteam0ps, elhoim"], "description": "Detects the creation of a named pipe seen used by known APTs or malware.", "rule_id": "fe3ac066-98bb-432a-b1e7-a5229cb39d4a", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://securelist.com/wild-neutron-economic-espionage-threat-actor-returns-with-new-tricks/71275/", "https://securelist.com/faq-the-projectsauron-apt/75533/", "https://web.archive.org/web/20180725233601/https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf", "https://www.us-cert.gov/ncas/alerts/TA17-117A", "https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html", "https://thedfirreport.com/2020/06/21/snatch-ransomware/", "https://github.com/RiccardoAncarani/LiquidSnake", "https://www.accenture.com/us-en/blogs/cyber-defense/turla-belugasturgeon-compromises-government-entity", "https://us-cert.cisa.gov/ncas/analysis-reports/ar19-304a", "https://download.bitdefender.com/resources/files/News/CaseStudies/study/115/Bitdefender-Whitepaper-PAC-A4-en-EN1.pdf", "https://unit42.paloaltonetworks.com/emissary-panda-attacks-middle-east-government-sharepoint-servers/", "https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and (PipeName like~ (\"\\\\46a676ab7f179e511e30dd2dc41bd388\", \"\\\\583da945-62af-10e8-4902-a8f205c72b2e\", \"\\\\6e7645c4-32c5-4fe3-aabf-e94c2f4370e7\", \"\\\\9f81f59bc58452127884ce513865ed20\", \"\\\\adschemerpc\", \"\\\\ahexec\", \"\\\\AnonymousPipe\", \"\\\\bc31a7\", \"\\\\bc367\", \"\\\\bizkaz\", \"\\\\csexecsvc\", \"\\\\dce_3d\", \"\\\\e710f28d59aa529d6792ca6ff0ca1b34\", \"\\\\gruntsvc\", \"\\\\isapi_dg\", \"\\\\isapi_dg2\", \"\\\\isapi_http\", \"\\\\jaccdpqnvbrrxlaf\", \"\\\\lsassw\", \"\\\\NamePipe_MoreWindows\", \"\\\\pcheap_reuse\", \"\\\\Posh*\", \"\\\\rpchlp_3\", \"\\\\sdlrpc\", \"\\\\svcctl\", \"\\\\testPipe\", \"\\\\winsession\"))", "filters": [], "actions": []}
{"id": "41504465-5e3a-4a5b-a5b4-2a0baadd4463", "name": "SIGMA - PsExec Tool Execution From Suspicious Locations - PipeName", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects PsExec default pipe creation where the image executed is located in a suspicious location. Which could indicate that the tool is being used in an attack", "rule_id": "41504465-5e3a-4a5b-a5b4-2a0baadd4463", "false_positives": ["Rare legitimate use of psexec from the locations mentioned above. This will require initial tuning based on your environment."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "reference": "https://attack.mitre.org/techniques/T1569", "name": "System Services", "subtechnique": [{"id": "T1569.002", "reference": "https://attack.mitre.org/techniques/T1569/002", "name": "Service Execution"}]}]}], "tags": [], "to": "now", "references": ["https://www.jpcert.or.jp/english/pub/sr/ir_research.html", "https://jpcertcc.github.io/ToolAnalysisResultSheet"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (17, 18)) and (PipeName:\"\\\\PSEXESVC\" and (Image like~ (\"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\Desktop\\\\*\", \"*\\\\Downloads\\\\*\")))", "filters": [], "actions": []}
