{"id": "3b4b232a-af90-427c-a22f-30b0c0837b95", "name": "SIGMA - CMSTP Execution Process Access", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nik Seetharaman"], "description": "Detects various indicators of Microsoft Connection Manager Profile Installer execution", "rule_id": "3b4b232a-af90-427c-a22f-30b0c0837b95", "false_positives": ["Legitimate CMSTP use (unlikely in modern enterprise environments)"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "reference": "https://attack.mitre.org/techniques/T1218", "name": "System Binary Proxy Execution", "subtechnique": [{"id": "T1218.003", "reference": "https://attack.mitre.org/techniques/T1218/003", "name": "CMSTP"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1559", "reference": "https://attack.mitre.org/techniques/T1559", "name": "Inter-Process Communication", "subtechnique": [{"id": "T1559.001", "reference": "https://attack.mitre.org/techniques/T1559/001", "name": "Component Object Model"}]}]}], "tags": ["car-2019-04-001"], "to": "now", "references": ["https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and CallTrace:\"*cmlua.dll*\"", "filters": [], "actions": []}
{"id": "09706624-b7f6-455d-9d02-adee024cee1d", "name": "SIGMA - HackTool - CobaltStrike BOF Injection Pattern", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Christian Burkard (Nextron Systems)"], "description": "Detects a typical pattern of a CobaltStrike BOF which inject into other processes", "rule_id": "09706624-b7f6-455d-9d02-adee024cee1d", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1106", "reference": "https://attack.mitre.org/techniques/T1106", "name": "Native API", "subtechnique": []}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "reference": "https://attack.mitre.org/techniques/T1562", "name": "Impair Defenses", "subtechnique": [{"id": "T1562.001", "reference": "https://attack.mitre.org/techniques/T1562/001", "name": "Disable or Modify Tools"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/boku7/injectAmsiBypass", "https://github.com/boku7/spawn"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (CallTrace regex~ \"^C:\\\\Windows\\\\SYSTEM32\\\\ntdll\\.dll\\+[a-z0-9]{4,6}\\|C:\\\\Windows\\\\System32\\\\KERNELBASE\\.dll\\+[a-z0-9]{4,6}\\|UNKNOWN\\([A-Z0-9]{16}\\)$\" and (GrantedAccess like~ (\"0x1028\", \"0x1fffff\")))", "filters": [], "actions": []}
{"id": "d0d2f720-d14f-448d-8242-51ff396a334e", "name": "SIGMA - HackTool - Generic Process Access", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel"], "description": "Detects process access requests from hacktool processes based on their default image name", "rule_id": "d0d2f720-d14f-448d-8242-51ff396a334e", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://jsecurity101.medium.com/bypassing-access-mask-auditing-strategies-480fb641c158", "https://www.splunk.com/en_us/blog/security/you-bet-your-lsass-hunting-lsass-access.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((SourceImage like~ (\"*\\\\Akagi.exe\", \"*\\\\Akagi64.exe\", \"*\\\\atexec_windows.exe\", \"*\\\\Certify.exe\", \"*\\\\Certipy.exe\", \"*\\\\CoercedPotato.exe\", \"*\\\\crackmapexec.exe\", \"*\\\\CreateMiniDump.exe\", \"*\\\\dcomexec_windows.exe\", \"*\\\\dpapi_windows.exe\", \"*\\\\findDelegation_windows.exe\", \"*\\\\GetADUsers_windows.exe\", \"*\\\\GetNPUsers_windows.exe\", \"*\\\\getPac_windows.exe\", \"*\\\\getST_windows.exe\", \"*\\\\getTGT_windows.exe\", \"*\\\\GetUserSPNs_windows.exe\", \"*\\\\gmer.exe\", \"*\\\\hashcat.exe\", \"*\\\\htran.exe\", \"*\\\\ifmap_windows.exe\", \"*\\\\impersonate.exe\", \"*\\\\Inveigh.exe\", \"*\\\\LocalPotato.exe\", \"*\\\\mimikatz_windows.exe\", \"*\\\\mimikatz.exe\", \"*\\\\netview_windows.exe\", \"*\\\\nmapAnswerMachine_windows.exe\", \"*\\\\opdump_windows.exe\", \"*\\\\PasswordDump.exe\", \"*\\\\Potato.exe\", \"*\\\\PowerTool.exe\", \"*\\\\PowerTool64.exe\", \"*\\\\psexec_windows.exe\", \"*\\\\PurpleSharp.exe\", \"*\\\\pypykatz.exe\", \"*\\\\QuarksPwDump.exe\", \"*\\\\rdp_check_windows.exe\", \"*\\\\Rubeus.exe\", \"*\\\\SafetyKatz.exe\", \"*\\\\sambaPipe_windows.exe\", \"*\\\\SelectMyParent.exe\", \"*\\\\SharpChisel.exe\", \"*\\\\SharPersist.exe\", \"*\\\\SharpEvtMute.exe\", \"*\\\\SharpImpersonation.exe\", \"*\\\\SharpLDAPmonitor.exe\", \"*\\\\SharpLdapWhoami.exe\", \"*\\\\SharpUp.exe\", \"*\\\\SharpView.exe\", \"*\\\\smbclient_windows.exe\", \"*\\\\smbserver_windows.exe\", \"*\\\\sniff_windows.exe\", \"*\\\\sniffer_windows.exe\", \"*\\\\split_windows.exe\", \"*\\\\SpoolSample.exe\", \"*\\\\Stracciatella.exe\", \"*\\\\SysmonEOP.exe\", \"*\\\\temp\\\\rot.exe\", \"*\\\\ticketer_windows.exe\", \"*\\\\TruffleSnout.exe\", \"*\\\\winPEASany_ofs.exe\", \"*\\\\winPEASany.exe\", \"*\\\\winPEASx64_ofs.exe\", \"*\\\\winPEASx64.exe\", \"*\\\\winPEASx86_ofs.exe\", \"*\\\\winPEASx86.exe\", \"*\\\\xordump.exe\")) or (SourceImage like~ (\"*\\\\goldenPac*\", \"*\\\\just_dce_*\", \"*\\\\karmaSMB*\", \"*\\\\kintercept*\", \"*\\\\LocalPotato*\", \"*\\\\ntlmrelayx*\", \"*\\\\rpcdump*\", \"*\\\\samrdump*\", \"*\\\\secretsdump*\", \"*\\\\smbexec*\", \"*\\\\smbrelayx*\", \"*\\\\wmiexec*\", \"*\\\\wmipersist*\", \"*HotPotato*\", \"*Juicy Potato*\", \"*JuicyPotato*\", \"*PetitPotam*\", \"*RottenPotato*\")))", "filters": [], "actions": []}
{"id": "b1bd3a59-c1fd-4860-9f40-4dd161a7d1f5", "name": "SIGMA - HackTool - HandleKatz Duplicating LSASS Handle", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Bhabesh Raj (rule), @thefLinkk"], "description": "Detects HandleKatz opening LSASS to duplicate its handle to later dump the memory without opening any new handles", "rule_id": "b1bd3a59-c1fd-4860-9f40-4dd161a7d1f5", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1106", "reference": "https://attack.mitre.org/techniques/T1106", "name": "Native API", "subtechnique": []}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/codewhitesec/HandleKatz"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (TargetImage:\"*\\\\lsass.exe\" and GrantedAccess:\"0x1440\" and CallTrace:\"C:\\\\Windows\\\\System32\\\\ntdll.dll+*\" and CallTrace:\"*|UNKNOWN(*\" and CallTrace:\"*)\")", "filters": [], "actions": []}
{"id": "7bdde3bf-2a42-4c39-aa31-a92b3e17afac", "name": "SIGMA - HackTool - LittleCorporal Generated Maldoc Injection", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Christian Burkard (Nextron Systems)"], "description": "Detects the process injection of a LittleCorporal generated Maldoc.", "rule_id": "7bdde3bf-2a42-4c39-aa31-a92b3e17afac", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "reference": "https://attack.mitre.org/techniques/T1204", "name": "User Execution", "subtechnique": [{"id": "T1204.002", "reference": "https://attack.mitre.org/techniques/T1204/002", "name": "Malicious File"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": [{"id": "T1055.003", "reference": "https://attack.mitre.org/techniques/T1055/003", "name": "Thread Execution Hijacking"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/connormcgarr/LittleCorporal"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (SourceImage:\"*\\\\winword.exe\" and (CallTrace:\"*:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v2.*\" and CallTrace:\"*UNKNOWN*\"))", "filters": [], "actions": []}
{"id": "d29ada0f-af45-4f27-8f32-f7b77c3dbc4e", "name": "SIGMA - HackTool - SysmonEnte Execution", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects the use of SysmonEnte, a tool to attack the integrity of Sysmon", "rule_id": "d29ada0f-af45-4f27-8f32-f7b77c3dbc4e", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "reference": "https://attack.mitre.org/techniques/T1562", "name": "Impair Defenses", "subtechnique": [{"id": "T1562.002", "reference": "https://attack.mitre.org/techniques/T1562/002", "name": "Disable Windows Event Logging"}]}]}], "tags": [], "to": "now", "references": ["https://codewhitesec.blogspot.com/2022/09/attacks-on-sysmon-revisited-sysmonente.html", "https://github.com/codewhitesec/SysmonEnte/", "https://github.com/codewhitesec/SysmonEnte/blob/fe267690fcc799fbda15398243615a30451d9099/screens/1.png"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((((TargetImage like~ (\"*:\\\\Windows\\\\Sysmon.exe*\", \"*:\\\\Windows\\\\Sysmon64.exe*\")) and GrantedAccess:\"0x1400\") and (not ((SourceImage like~ (\"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\")) or (SourceImage:\"*:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\*\" and SourceImage:\"*\\\\MsMpEng.exe\")))) or CallTrace:\"Ente\")", "filters": [], "actions": []}
{"id": "a49fa4d5-11db-418c-8473-1e014a8dd462", "name": "SIGMA - Lsass Memory Dump via Comsvcs DLL", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)"], "description": "Detects adversaries leveraging the MiniDump export function from comsvcs.dll via rundll32 to perform a memory dump from lsass.", "rule_id": "a49fa4d5-11db-418c-8473-1e014a8dd462", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/shantanukhande/status/1229348874298388484", "https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (TargetImage:\"*\\\\lsass.exe\" and SourceImage:\"*\\\\rundll32.exe\" and CallTrace:\"*comsvcs.dll*\")", "filters": [], "actions": []}
{"id": "9bd012ee-0dff-44d7-84a0-aa698cfd87a3", "name": "SIGMA - LSASS Memory Access by Tool With Dump Keyword In Name", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects LSASS process access requests from a source process with the \"dump\" keyword in its image name.", "rule_id": "9bd012ee-0dff-44d7-84a0-aa698cfd87a3", "false_positives": ["Rare programs that contain the word dump in their name and access lsass"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/_xpn_/status/1491557187168178176", "https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (TargetImage:\"*\\\\lsass.exe\" and SourceImage:\"*dump*\" and (GrantedAccess like~ (\"*10\", \"*30\", \"*50\", \"*70\", \"*90\", \"*B0\", \"*D0\", \"*F0\", \"*18\", \"*38\", \"*58\", \"*78\", \"*98\", \"*B8\", \"*D8\", \"*F8\", \"*1A\", \"*3A\", \"*5A\", \"*7A\", \"*9A\", \"*BA\", \"*DA\", \"*FA\", \"*0x14C2\", \"*FF\")))", "filters": [], "actions": []}
{"id": "5ef9853e-4d0e-4a70-846f-a9ca37d876da", "name": "SIGMA - Potential Credential Dumping Activity Via LSASS", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Samir Bousseaden, Michael Haag"], "description": "Detects process access requests to the LSASS process with specific call trace calls and access masks.\nThis behaviour is expressed by many credential dumping tools such as Mimikatz, NanoDump, Invoke-Mimikatz, Procdump and even the Taskmgr dumping feature.\n", "rule_id": "5ef9853e-4d0e-4a70-846f-a9ca37d876da", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://web.archive.org/web/20230329170326/https://blog.menasec.net/2019/02/threat-hunting-21-procdump-or-taskmgr.html", "https://web.archive.org/web/20230208123920/https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.001/T1003.001.md", "https://research.splunk.com/endpoint/windows_possible_credential_dumping/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((TargetImage:\"*\\\\lsass.exe\" and (GrantedAccess like~ (\"*0x1038*\", \"*0x1438*\", \"*0x143a*\", \"*0x1fffff*\")) and (CallTrace like~ (\"*dbgcore.dll*\", \"*dbghelp.dll*\", \"*kernel32.dll*\", \"*kernelbase.dll*\", \"*ntdll.dll*\"))) and (not (SourceUser like~ (\"*AUTHORI*\", \"*AUTORI*\"))) and (not (((CallTrace:\"*:\\\\Windows\\\\Temp\\\\asgard2-agent\\\\*\" and CallTrace:\"*\\\\thor\\\\thor64.exe+*\" and CallTrace:\"*|UNKNOWN(*\") and GrantedAccess:\"0x103800\") or SourceImage:\"*:\\\\Windows\\\\Sysmon64.exe\")))", "filters": [], "actions": []}
{"id": "f8be3e82-46a3-4e4e-ada5-8e538ae8b9c9", "name": "SIGMA - Credential Dumping Activity By Python Based Tool", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Bhabesh Raj, Jonhnathan Ribeiro"], "description": "Detects LSASS process access for potential credential dumping by a Python-like tool such as LaZagne or Pypykatz.", "rule_id": "f8be3e82-46a3-4e4e-ada5-8e538ae8b9c9", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/bh4b3sh/status/1303674603819081728", "https://github.com/skelsec/pypykatz"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (TargetImage:\"*\\\\lsass.exe\" and (CallTrace:\"*_ctypes.pyd+*\" and CallTrace:\"*:\\\\Windows\\\\System32\\\\KERNELBASE.dll+*\" and CallTrace:\"*:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll+*\") and (CallTrace like~ (\"*python27.dll+*\", \"*python3*.dll+*\")) and GrantedAccess:\"0x1FFFFF\")", "filters": [], "actions": []}
{"id": "aa35a627-33fb-4d04-a165-d33b4afca3e8", "name": "SIGMA - Remote LSASS Process Access Through Windows Remote Management", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Patryk Prauze - ING Tech"], "description": "Detects remote access to the LSASS process via WinRM. This could be a sign of credential dumping from tools like mimikatz.", "rule_id": "aa35a627-33fb-4d04-a165-d33b4afca3e8", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "reference": "https://attack.mitre.org/techniques/T1059", "name": "Command and Scripting Interpreter", "subtechnique": [{"id": "T1059.001", "reference": "https://attack.mitre.org/techniques/T1059/001", "name": "PowerShell"}]}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.006", "reference": "https://attack.mitre.org/techniques/T1021/006", "name": "Windows Remote Management"}]}]}], "tags": [], "to": "now", "references": ["https://pentestlab.blog/2018/05/15/lateral-movement-winrm/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((TargetImage:\"*\\\\lsass.exe\" and SourceImage:\"*:\\\\Windows\\\\system32\\\\wsmprovhost.exe\") and (not GrantedAccess:\"0x80000000\"))", "filters": [], "actions": []}
{"id": "472159c5-31b9-4f56-b794-b766faa8b0a7", "name": "SIGMA - Suspicious LSASS Access Via MalSecLogon", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Samir Bousseaden (original elastic rule), Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects suspicious access to LSASS handle via a call trace to \"seclogon.dll\" with a suspicious access right.", "rule_id": "472159c5-31b9-4f56-b794-b766faa8b0a7", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/SBousseaden/status/1541920424635912196", "https://github.com/elastic/detection-rules/blob/2bc1795f3d7bcc3946452eb4f07ae799a756d94e/rules/windows/credential_access_lsass_handle_via_malseclogon.toml", "https://splintercod3.blogspot.com/p/the-hidden-side-of-seclogon-part-3.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (TargetImage:\"*\\\\lsass.exe\" and SourceImage:\"*\\\\svchost.exe\" and GrantedAccess:\"0x14c0\" and CallTrace:\"*seclogon.dll*\")", "filters": [], "actions": []}
{"id": "a18dd26b-6450-46de-8c91-9659150cf088", "name": "SIGMA - Potentially Suspicious GrantedAccess Flags On LSASS", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth, Roberto Rodriguez, Dimitrios Slamaris, Mark Russinovich, Thomas Patzke, Teymur Kheirkhabarov, Sherif Eldeeb, James Dickenson, Aleksey Potapov, oscd.community"], "description": "Detects process access requests to LSASS process with potentially suspicious access flags", "rule_id": "a18dd26b-6450-46de-8c91-9659150cf088", "false_positives": ["Legitimate software such as AV and EDR"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://learn.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights", "https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow", "https://web.archive.org/web/20230208123920/https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "https://web.archive.org/web/20230420013146/http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((TargetImage:\"*\\\\lsass.exe\" and ((GrantedAccess like~ (\"*30\", \"*50\", \"*70\", \"*90\", \"*B0\", \"*D0\", \"*F0\", \"*18\", \"*38\", \"*58\", \"*78\", \"*98\", \"*B8\", \"*D8\", \"*F8\", \"*1A\", \"*3A\", \"*5A\", \"*7A\", \"*9A\", \"*BA\", \"*DA\", \"*FA\", \"*0x14C2\")) or (GrantedAccess like~ (\"0x100000*\", \"0x1418*\", \"0x1438*\", \"0x143a*\", \"0x1f0fff*\", \"0x1f1fff*\", \"0x1f2fff*\", \"0x1f3fff*\", \"0x40*\")))) and (not ((SourceImage like~ (\"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\")) or (SourceImage:\"*:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*\" and SourceImage:\"*\\\\MsMpEng.exe\") or ((CallTrace:\"*|?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Definition Updates\\\\{*\" and CallTrace:\"*}\\\\mpengine.dll+*\") and GrantedAccess:\"0x1418\") or (CallTrace like~ (\"*|c:\\\\program files\\\\windows defender\\\\mprtp.dll*\", \"*|c:\\\\program files\\\\windows defender\\\\MpClient.dll*\")) or (SourceImage:\"*\\\\explorer.exe\" and GrantedAccess:\"0x401\"))) and (not (SourceImage:\"*:\\\\ProgramData\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe\" or SourceImage:\"*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\" or (SourceImage:\"*:\\\\ProgramData\\\\VMware\\\\VMware Tools\\\\*\" and SourceImage:\"*\\\\vmtoolsd.exe\") or ((SourceImage like~ (\"*\\\\PROCEXP64.EXE\", \"*\\\\PROCEXP.EXE\")) and GrantedAccess:\"0x40\") or (SourceImage:\"*\\\\MBAMInstallerService.exe\" and GrantedAccess:\"0x40\") or ((SourceImage like~ (\"*\\\\aurora-agent-64.exe\", \"*\\\\aurora-agent.exe\", \"*\\\\thor.exe\", \"*\\\\thor64.exe\")) and GrantedAccess:\"0x40\") or ((SourceImage like~ (\"*\\\\handle.exe\", \"*\\\\handle64.exe\")) and GrantedAccess:\"0x40\") or (SourceImage:\"*\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe\" and GrantedAccess:\"0x401\") or SourceImage:\"*\\\\SteamLibrary\\\\steamapps\\\\*\")))", "filters": [], "actions": []}
{"id": "e5b33f7d-eb93-48b6-9851-09e1e610b6d7", "name": "SIGMA - Credential Dumping Attempt Via WerFault", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz, Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or dbgcore.dll for win10, server2016 and up.", "rule_id": "e5b33f7d-eb93-48b6-9851-09e1e610b6d7", "false_positives": ["Actual failures in lsass.exe that trigger a crash dump (unlikely)", "Unknown cases in which WerFault accesses lsass.exe"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/helpsystems/nanodump/commit/578116faea3d278d53d70ea932e2bbfe42569507"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (SourceImage:\"*\\\\WerFault.exe\" and TargetImage:\"*\\\\lsass.exe\" and GrantedAccess:\"0x1FFFFF\")", "filters": [], "actions": []}
{"id": "4be8b654-0c01-4c9d-a10c-6b28467fc651", "name": "SIGMA - LSASS Access From Potentially White-Listed Processes", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects a possible process memory dump that uses a white-listed filename like TrolleyExpress.exe as a way to dump the LSASS process memory without Microsoft Defender interference\n", "rule_id": "4be8b654-0c01-4c9d-a10c-6b28467fc651", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/_xpn_/status/1491557187168178176", "https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz", "https://twitter.com/mrd0x/status/1460597833917251595"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (TargetImage:\"*\\\\lsass.exe\" and (SourceImage like~ (\"*\\\\TrolleyExpress.exe\", \"*\\\\ProcessDump.exe\", \"*\\\\dump64.exe\")) and (GrantedAccess like~ (\"*10\", \"*30\", \"*50\", \"*70\", \"*90\", \"*B0\", \"*D0\", \"*F0\", \"*18\", \"*38\", \"*58\", \"*78\", \"*98\", \"*B8\", \"*D8\", \"*F8\", \"*1A\", \"*3A\", \"*5A\", \"*7A\", \"*9A\", \"*BA\", \"*DA\", \"*FA\", \"*0x14C2\", \"*FF\")))", "filters": [], "actions": []}
{"id": "a24e5861-c6ca-4fde-a93c-ba9256feddf0", "name": "SIGMA - Uncommon Process Access Rights For Target Image", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems), frack113"], "description": "Detects process access request to uncommon target images with a \"PROCESS_ALL_ACCESS\" access mask.\n", "rule_id": "a24e5861-c6ca-4fde-a93c-ba9256feddf0", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": [{"id": "T1055.011", "reference": "https://attack.mitre.org/techniques/T1055/011", "name": "Extra Window Memory Injection"}]}]}], "tags": [], "to": "now", "references": ["https://learn.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((TargetImage like~ (\"*\\\\calc.exe\", \"*\\\\calculator.exe\", \"*\\\\mspaint.exe\", \"*\\\\notepad.exe\", \"*\\\\ping.exe\", \"*\\\\wordpad.exe\", \"*\\\\write.exe\")) and GrantedAccess:\"0x1FFFFF\")", "filters": [], "actions": []}
{"id": "3f3f3506-1895-401b-9cc3-e86b16e630d0", "name": "SIGMA - Potential Direct Syscall of NtOpenProcess", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Christian Burkard (Nextron Systems), Tim Shelton (FP)"], "description": "Detects potential calls to NtOpenProcess directly from NTDLL.", "rule_id": "3f3f3506-1895-401b-9cc3-e86b16e630d0", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1106", "reference": "https://attack.mitre.org/techniques/T1106", "name": "Native API", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://medium.com/falconforce/falconfriday-direct-system-calls-and-cobalt-strike-bofs-0xff14-741fa8e1bdd6"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (CallTrace:\"UNKNOWN*\" and (not ((TargetImage:\"*vcredist_x64.exe\" and SourceImage:\"*vcredist_x64.exe\") or ((SourceImage like~ (\"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\", \"*:\\\\Windows\\\\WinSxS\\\\*\")) and (TargetImage like~ (\"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\", \"*:\\\\Windows\\\\WinSxS\\\\*\"))) or Provider_Name:\"Microsoft-Windows-Kernel-Audit-API-Calls\")) and (not ((TargetImage:\"*:\\\\Windows\\\\system32\\\\systeminfo.exe\" and SourceImage:\"*setup64.exe\") or (SourceImage:\"*:\\\\Windows\\\\Explorer.EXE\" and TargetImage:\"*:\\\\Program Files\\\\Cylance\\\\Desktop\\\\CylanceUI.exe\") or (SourceImage:\"*AmazonSSMAgentSetup.exe\" and TargetImage:\"*AmazonSSMAgentSetup.exe\") or (SourceImage:\"*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\" and TargetImage:\"*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\") or (TargetImage:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" and SourceImage:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\") or (TargetImage:\"*\\\\AppData\\\\Local\\\\Discord\\\\*\" and TargetImage:\"*\\\\Discord.exe\") or (SourceImage:\"*\\\\AppData\\\\Local\\\\yammerdesktop\\\\app-*\" and SourceImage:\"*\\\\Yammer.exe\" and TargetImage:\"*\\\\AppData\\\\Local\\\\yammerdesktop\\\\app-*\" and TargetImage:\"*\\\\Yammer.exe\" and GrantedAccess:\"0x1000\") or TargetImage:\"*\\\\Evernote\\\\Evernote.exe\" or (SourceImage:\"*:\\\\Program Files\\\\Adobe\\\\Acrobat DC\\\\Acrobat\\\\*\" and SourceImage:\"*\\\\AcroCEF.exe\" and TargetImage:\"*:\\\\Program Files\\\\Adobe\\\\Acrobat DC\\\\Acrobat\\\\*\" and TargetImage:\"*\\\\AcroCEF.exe\"))))", "filters": [], "actions": []}
{"id": "174afcfa-6e40-4ae9-af64-496546389294", "name": "SIGMA - Credential Dumping Attempt Via Svchost", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florent Labouyrie"], "description": "Detects when a process tries to access the memory of svchost to potentially dump credentials.", "rule_id": "174afcfa-6e40-4ae9-af64-496546389294", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1548", "reference": "https://attack.mitre.org/techniques/T1548", "name": "Abuse Elevation Control Mechanism", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["Internal Research"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((TargetImage:\"*\\\\svchost.exe\" and GrantedAccess:\"0x143a\") and (not (SourceImage like~ (\"*\\\\services.exe\", \"*\\\\msiexec.exe\"))))", "filters": [], "actions": []}
{"id": "166e9c50-8cd9-44af-815d-d1f0c0e90dde", "name": "SIGMA - Suspicious Svchost Process Access", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Tim Burrell"], "description": "Detects suspicious access to the \"svchost\" process such as that used by Invoke-Phantom to kill the thread of the Windows event logging service.", "rule_id": "166e9c50-8cd9-44af-815d-d1f0c0e90dde", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "reference": "https://attack.mitre.org/techniques/T1562", "name": "Impair Defenses", "subtechnique": [{"id": "T1562.002", "reference": "https://attack.mitre.org/techniques/T1562/002", "name": "Disable Windows Event Logging"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/hlldz/Invoke-Phant0m", "https://twitter.com/timbmsft/status/900724491076214784"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and ((TargetImage:\"*:\\\\Windows\\\\System32\\\\svchost.exe\" and GrantedAccess:\"0x1F3FFF\" and CallTrace:\"*UNKNOWN*\") and (not (SourceImage:\"*:\\\\Program Files\\\\Microsoft Visual Studio\\\\*\" and SourceImage:\"*\\\\MSBuild\\\\Current\\\\Bin\\\\MSBuild.exe\" and (CallTrace like~ (\"*Microsoft.Build.ni.dll*\", \"*System.ni.dll*\")))))", "filters": [], "actions": []}
{"id": "fb3722e4-1a06-46b6-b772-253e2e7db933", "name": "SIGMA - Function Call From Undocumented COM Interface EditionUpgradeManager", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["oscd.community, Dmitry Uchakin"], "description": "Detects function calls from the EditionUpgradeManager COM interface. Which is an interface that is not used by standard executables.", "rule_id": "fb3722e4-1a06-46b6-b772-253e2e7db933", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1548", "reference": "https://attack.mitre.org/techniques/T1548", "name": "Abuse Elevation Control Mechanism", "subtechnique": [{"id": "T1548.002", "reference": "https://attack.mitre.org/techniques/T1548/002", "name": "Bypass User Account Control"}]}]}], "tags": [], "to": "now", "references": ["https://www.snip2code.com/Snippet/4397378/UAC-bypass-using-EditionUpgradeManager-C/", "https://gist.github.com/hfiref0x/de9c83966623236f5ebf8d9ae2407611"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and CallTrace:\"*editionupgrademanagerobj.dll*\"", "filters": [], "actions": []}
{"id": "4f6c43e2-f989-4ea5-bcd8-843b49a0317c", "name": "SIGMA - UAC Bypass Using WOW64 Logger DLL Hijack", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Christian Burkard (Nextron Systems)"], "description": "Detects the pattern of UAC Bypass using a WoW64 logger DLL hijack (UACMe 30)", "rule_id": "4f6c43e2-f989-4ea5-bcd8-843b49a0317c", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1548", "reference": "https://attack.mitre.org/techniques/T1548", "name": "Abuse Elevation Control Mechanism", "subtechnique": [{"id": "T1548.002", "reference": "https://attack.mitre.org/techniques/T1548/002", "name": "Bypass User Account Control"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/hfiref0x/UACME"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:10 and (SourceImage:\"*:\\\\Windows\\\\SysWOW64\\\\*\" and GrantedAccess:\"0x1fffff\" and CallTrace:\"UNKNOWN(0000000000000000)|UNKNOWN(0000000000000000)|*\")", "filters": [], "actions": []}
