{"id": "c4b890e5-8d8c-4496-8c66-c805753817cd", "name": "SIGMA - Potential Process Hollowing Activity", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Sittikorn S"], "description": "Detects when a memory process image does not match the disk image, indicative of process hollowing.", "rule_id": "c4b890e5-8d8c-4496-8c66-c805753817cd", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "reference": "https://attack.mitre.org/techniques/T1055", "name": "Process Injection", "subtechnique": [{"id": "T1055.012", "reference": "https://attack.mitre.org/techniques/T1055/012", "name": "Process Hollowing"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/SecurePeacock/status/1486054048390332423?s=20", "https://www.bleepingcomputer.com/news/microsoft/microsoft-sysmon-now-detects-malware-process-tampering-attempts/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:25 and (Type:\"Image is replaced\" and (not (Image like~ (\"*:\\\\Program Files (x86)*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\wbem\\\\WMIADAP.exe*\", \"*:\\\\Windows\\\\SysWOW64\\\\wbem\\\\WMIADAP.exe*\"))) and (not ((Image:\"*\\\\AppData\\\\Local\\\\Programs\\\\Opera\\\\*\" and Image:\"*\\\\opera.exe\") or Image:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\")))", "filters": [], "actions": []}
