{"id": "db809f10-56ce-4420-8c86-d6a7d793c79c", "name": "SIGMA - Potential Defense Evasion Via Raw Disk Access By Uncommon Tools", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Teymur Kheirkhabarov, oscd.community"], "description": "Detects raw disk access using uncommon tools or tools that are located in suspicious locations (heavy filtering is required), which could indicate possible defense evasion attempts", "rule_id": "db809f10-56ce-4420-8c86-d6a7d793c79c", "false_positives": ["Likely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1006", "reference": "https://attack.mitre.org/techniques/T1006", "name": "Direct Volume Access", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:9 and ((not (Device:\"*floppy*\" or (Image like~ (\"*:\\\\$WINDOWS.~BT\\\\*\", \"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\CCM\\\\*\", \"*:\\\\Windows\\\\explorer.exe*\", \"*:\\\\Windows\\\\servicing\\\\*\", \"*:\\\\Windows\\\\SoftwareDistribution\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\", \"*:\\\\Windows\\\\SystemApps\\\\*\", \"*:\\\\Windows\\\\uus\\\\*\", \"*:\\\\Windows\\\\WinSxS\\\\*\")) or (Image like~ (\"Registry\", \"System\")) or (Image:\"*:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\*\" and (Image like~ (\"*\\\\MsMpEng.exe\", \"*\\\\MpDefenderCoreService.exe\"))) or (Image:\"*:\\\\Users\\\\*\" and Image:\"*\\\\AppData\\\\*\" and Image:\"*\\\\Microsoft\\\\*\") or (Image:\"*:\\\\Windows\\\\Temp\\\\*\" and (Image like~ (\"*\\\\Executables\\\\SSDUpdate.exe\", \"*\\\\HostMetadata\\\\NVMEHostmetadata.exe\"))) or (?Image == null) or Image:\"*:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe\")) and (not ((Image:\"*\\\\AppData\\\\Local\\\\GitHubDesktop\\\\app-*\" and Image:\"*\\\\resources\\\\app\\\\git\\\\mingw64\\\\bin\\\\git.exe\") or (Image:\"*:\\\\Windows\\\\Temp\\\\asgard2-agent\\\\*\" and Image:\"*\\\\thor.exe\") or Image:\"*\\\\AppData\\\\Local\\\\Keybase\\\\upd.exe*\")))", "filters": [], "actions": []}
