{"id": "8ac03a65-6c84-4116-acad-dc1558ff7a77", "name": "SIGMA - Sysmon Configuration Change", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Detects a Sysmon configuration change, which could be the result of a legitimate reconfiguration or someone trying manipulate the configuration", "rule_id": "8ac03a65-6c84-4116-acad-dc1558ff7a77", "false_positives": ["Legitimate administrative action"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-defense-evasion"], "to": "now", "references": ["https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:16", "filters": [], "actions": []}
{"id": "815cd91b-7dbc-4247-841a-d7dd1392b0a8", "name": "SIGMA - Sysmon Configuration Error", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Detects when an adversary is trying to hide it's action from Sysmon logging based on error messages", "rule_id": "815cd91b-7dbc-4247-841a-d7dd1392b0a8", "false_positives": ["Legitimate administrative action"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "reference": "https://attack.mitre.org/techniques/T1564", "name": "Hide Artifacts", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md", "https://talesfrominfosec.blogspot.com/2017/12/killing-sysmon-silently.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:255 and ((Description like~ (\"*Failed to open service configuration with error*\", \"*Failed to connect to the driver to update configuration*\")) and (not ((Description:\"*Failed to open service configuration with error*\" and Description:\"*Last error: The media is write protected.*\") or (Description like~ (\"*Failed to open service configuration with error 19*\", \"*Failed to open service configuration with error 93*\")))))", "filters": [], "actions": []}
{"id": "1f2b5353-573f-4880-8e33-7d04dcf97744", "name": "SIGMA - Sysmon Configuration Modification", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Detects when an attacker tries to hide from Sysmon by disabling or stopping it", "rule_id": "1f2b5353-573f-4880-8e33-7d04dcf97744", "false_positives": ["Legitimate administrative action"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "reference": "https://attack.mitre.org/techniques/T1564", "name": "Hide Artifacts", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md", "https://talesfrominfosec.blogspot.com/2017/12/killing-sysmon-silently.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (EventID like~ (4, 16)) and ((State:\"Stopped\" or \"Sysmon config state changed\") and (not State:\"Started\"))", "filters": [], "actions": []}
{"id": "23b71bc5-953e-4971-be4c-c896cda73fc2", "name": "SIGMA - Sysmon Blocked Executable", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Triggers on any Sysmon \"FileBlockExecutable\" event, which indicates a violation of the configured block policy", "rule_id": "23b71bc5-953e-4971-be4c-c896cda73fc2", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-defense-evasion"], "to": "now", "references": ["https://medium.com/@olafhartong/sysmon-14-0-fileblockexecutable-13d7ba3dff3e"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:27", "filters": [], "actions": []}
{"id": "c3e5c1b1-45e9-4632-b242-27939c170239", "name": "SIGMA - Sysmon Blocked File Shredding", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Triggers on any Sysmon \"FileBlockShredding\" event, which indicates a violation of the configured shredding policy.", "rule_id": "c3e5c1b1-45e9-4632-b242-27939c170239", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-defense-evasion"], "to": "now", "references": ["https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:28", "filters": [], "actions": []}
{"id": "693a44e9-7f26-4cb6-b787-214867672d3a", "name": "SIGMA - Sysmon File Executable Creation Detected", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "Triggers on any Sysmon \"FileExecutableDetected\" event, which triggers every time a PE that is monitored by the config is created.", "rule_id": "693a44e9-7f26-4cb6-b787-214867672d3a", "false_positives": ["Unlikely"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-defense-evasion"], "to": "now", "references": ["https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon", "https://medium.com/@olafhartong/sysmon-15-0-file-executable-detected-40fd64349f36"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where EventID:29", "filters": [], "actions": []}
