{"id": "85254a62-22be-4239-b79c-2ec17e566c37", "name": "SIGMA - F5 BIG-IP iControl Rest API Command Execution - Webserver", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems), Thurein Oo"], "description": "Detects POST requests to the F5 BIG-IP iControl Rest API \"bash\" endpoint, which allows the execution of commands on the BIG-IP", "rule_id": "85254a62-22be-4239-b79c-2ec17e566c37", "false_positives": ["Legitimate usage of the BIG IP REST API to execute command for administration purposes"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://f5-sdk.readthedocs.io/en/latest/apidoc/f5.bigip.tm.util.html#module-f5.bigip.tm.util.bash", "https://community.f5.com/t5/technical-forum/icontrolrest-11-5-execute-bash-command/td-p/203029", "https://community.f5.com/t5/technical-forum/running-bash-commands-via-rest-api/td-p/272516"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-method:\"POST\" and cs-uri-query:\"*/mgmt/tm/util/bash\"", "filters": [], "actions": []}
{"id": "7cb02516-6d95-4ffc-8eee-162075e111ac", "name": "SIGMA - Successful IIS Shortname Fuzzing Scan", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113"], "description": "When IIS uses an old .Net Framework it's possible to enumerate folders with the symbol \"~\"", "rule_id": "7cb02516-6d95-4ffc-8eee-162075e111ac", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/projectdiscovery/nuclei-templates/blob/9d2889356eebba661c8407038e430759dfd4ec31/fuzzing/iis-shortname.yaml", "https://www.exploit-db.com/exploits/19525", "https://github.com/lijiejie/IIS_shortname_Scanner"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-uri-query:\"*~1*\" and cs-uri-query:\"*a.aspx\" and (cs-method like~ (\"GET\", \"OPTIONS\")) and (sc-status like~ (200, 301))", "filters": [], "actions": []}
{"id": "583aa0a2-30b1-4d62-8bf3-ab73689efe6c", "name": "SIGMA - Java Payload Strings", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["frack113, Harjot Singh, \"@cyb3rjy0t\" (update)"], "description": "Detects possible Java payloads in web access logs", "rule_id": "583aa0a2-30b1-4d62-8bf3-ab73689efe6c", "false_positives": ["Legitimate apps"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": ["cve-2022-26134", "cve-2021-26084"], "to": "now", "references": ["https://www.rapid7.com/blog/post/2022/06/02/active-exploitation-of-confluence-cve-2022-26134/", "https://www.rapid7.com/blog/post/2021/09/02/active-exploitation-of-confluence-server-cve-2021-26084/", "https://github.com/httpvoid/writeups/blob/62d3751945289d088ccfdf4d0ffbf61598a2cd7d/Confluence-RCE.md", "https://twitter.com/httpvoid0x2f/status/1532924261035384832", "https://medium.com/geekculture/text4shell-exploit-walkthrough-ebc02a01f035"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"%24%7B%28%23a%3D%40\" or \"${(#a=@\" or \"%24%7B%40java\" or \"${@java\" or \"u0022java\" or \"%2F%24%7B%23\" or \"/${#\" or \"new+java.\" or \"getRuntime().exec(\" or \"getRuntime%28%29.exec%28\"", "filters": [], "actions": []}
{"id": "412d55bc-7737-4d25-9542-5b396867ce55", "name": "SIGMA - JNDIExploit Pattern", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects exploitation attempt using the JNDI-Exploit-Kit", "rule_id": "412d55bc-7737-4d25-9542-5b396867ce55", "false_positives": ["Legitimate apps the use these paths"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/pimps/JNDI-Exploit-Kit", "https://web.archive.org/web/20231015205935/https://githubmemory.com/repo/FunctFan/JNDIExploit"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \"/Basic/Command/Base64/\" or \"/Basic/ReverseShell/\" or \"/Basic/TomcatMemshell\" or \"/Basic/JettyMemshell\" or \"/Basic/WeblogicMemshell\" or \"/Basic/JBossMemshell\" or \"/Basic/WebsphereMemshell\" or \"/Basic/SpringMemshell\" or \"/Deserialization/URLDNS/\" or \"/Deserialization/CommonsCollections1/Dnslog/\" or \"/Deserialization/CommonsCollections2/Command/Base64/\" or \"/Deserialization/CommonsBeanutils1/ReverseShell/\" or \"/Deserialization/Jre8u20/TomcatMemshell\" or \"/TomcatBypass/Dnslog/\" or \"/TomcatBypass/Command/\" or \"/TomcatBypass/ReverseShell/\" or \"/TomcatBypass/TomcatMemshell\" or \"/TomcatBypass/SpringMemshell\" or \"/GroovyBypass/Command/\" or \"/WebsphereBypass/Upload/\"", "filters": [], "actions": []}
{"id": "7745c2ea-24a5-4290-b680-04359cb84b35", "name": "SIGMA - Path Traversal Exploitation Attempts", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Subhash Popuri (@pbssubhash), Florian Roth (Nextron Systems), Thurein Oo, Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects path traversal exploitation attempts", "rule_id": "7745c2ea-24a5-4290-b680-04359cb84b35", "false_positives": ["Expected to be continuously seen on systems exposed to the Internet", "Internal vulnerability scanners"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/projectdiscovery/nuclei-templates", "https://book.hacktricks.xyz/pentesting-web/file-inclusion"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-uri-query like~ (\"*../../../../../lib/password*\", \"*../../../../windows/*\", \"*../../../etc/*\", \"*..%252f..%252f..%252fetc%252f*\", \"*..%c0%af..%c0%af..%c0%afetc%c0%af*\", \"*%252e%252e%252fetc%252f*\")", "filters": [], "actions": []}
{"id": "953d460b-f810-420a-97a2-cfca4c98e602", "name": "SIGMA - Source Code Enumeration Detection by Keyword", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["James Ahearn"], "description": "Detects source code enumeration that use GET requests by keyword searches in URL strings", "rule_id": "953d460b-f810-420a-97a2-cfca4c98e602", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1083", "reference": "https://attack.mitre.org/techniques/T1083", "name": "File and Directory Discovery", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://pentester.land/tutorials/2018/10/25/source-code-disclosure-via-exposed-git-folder.html", "https://medium.com/@logicbomb_1/bugbounty-how-i-was-able-to-download-the-source-code-of-indias-largest-telecom-service-52cf5c5640a1"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where \".git/\"", "filters": [], "actions": []}
{"id": "5513deaf-f49a-46c2-a6c8-3f111b5cb453", "name": "SIGMA - SQL Injection Strings In URI", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Saw Win Naung, Nasreddine Bencherchali (Nextron Systems), Thurein Oo (Yoma Bank)"], "description": "Detects potential SQL injection attempts via GET requests in access logs.", "rule_id": "5513deaf-f49a-46c2-a6c8-3f111b5cb453", "false_positives": ["Java scripts and CSS Files", "User searches in search boxes of the respective website", "Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as \"User Agent\" strings and more response codes"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.acunetix.com/blog/articles/exploiting-sql-injection-example/", "https://www.acunetix.com/blog/articles/using-logs-to-investigate-a-web-application-attack/", "https://brightsec.com/blog/sql-injection-payloads/", "https://github.com/payloadbox/sql-injection-payload-list", "https://book.hacktricks.xyz/pentesting-web/sql-injection/mysql-injection"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-method:\"GET\" and (\"@@version\" or \"%271%27%3D%271\" or \"=select \" or \"=select(\" or \"=select%20\" or \"concat_ws(\" or \"CONCAT(0x\" or \"from mysql.innodb_table_stats\" or \"from%20mysql.innodb_table_stats\" or \"group_concat(\" or \"information_schema.tables\" or \"json_arrayagg(\" or \"or 1=1#\" or \"or%201=1#\" or \"order by \" or \"order%20by%20\" or \"select * \" or \"select database()\" or \"select version()\" or \"select%20*%20\" or \"select%20database()\" or \"select%20version()\" or \"select%28sleep%2810%29\" or \"SELECTCHAR(\" or \"table_schema\" or \"UNION ALL SELECT\" or \"UNION SELECT\" or \"UNION%20ALL%20SELECT\" or \"UNION%20SELECT\" or \"'1'='1\") and (not sc-status:404)", "filters": [], "actions": []}
{"id": "ada3bc4f-f0fd-42b9-ba91-e105e8af7342", "name": "SIGMA - Server Side Template Injection Strings", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects SSTI attempts sent via GET requests in access logs", "rule_id": "ada3bc4f-f0fd-42b9-ba91-e105e8af7342", "false_positives": ["User searches in search boxes of the respective website", "Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as \"User Agent\" strings and more response codes"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1221", "reference": "https://attack.mitre.org/techniques/T1221", "name": "Template Injection", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://book.hacktricks.xyz/pentesting-web/ssti-server-side-template-injection", "https://github.com/payloadbox/ssti-payloads"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-method:\"GET\" and (\"={{\" or \"=%7B%7B\" or \"=${\" or \"=$%7B\" or \"=<%=\" or \"=%3C%25=\" or \"=@(\" or \"freemarker.template.utility.Execute\" or \".getClass().forName('javax.script.ScriptEngineManager')\" or \"T(org.apache.commons.io.IOUtils)\") and (not sc-status:404)", "filters": [], "actions": []}
{"id": "19aa4f58-94ca-45ff-bc34-92e533c0994a", "name": "SIGMA - Suspicious User-Agents Related To Recon Tools", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems), Tim Shelton"], "description": "Detects known suspicious (default) user-agents related to scanning/recon tools", "rule_id": "19aa4f58-94ca-45ff-bc34-92e533c0994a", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/wpscanteam/wpscan/blob/196fbab5b1ce3870a43515153d4f07878a89d410/lib/wpscan/browser.rb", "https://github.com/xmendez/wfuzz/blob/1b695ee9a87d66a7d7bf6cae70d60a33fae51541/docs/user/basicusage.rst", "https://github.com/lanmaster53/recon-ng/blob/9e907dfe09fce2997f0301d746796408e01a60b7/recon/core/base.py#L92"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-user-agent like~ (\"*Wfuzz/*\", \"*WPScan v*\", \"*Recon-ng/v*\", \"*GIS - AppSec Team - Project Vision*\")", "filters": [], "actions": []}
{"id": "9f6a34b4-2688-4eb7-a7f5-e39fef573d0e", "name": "SIGMA - Suspicious Windows Strings In URI", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects suspicious Windows strings in URI which could indicate possible exfiltration or webshell communication", "rule_id": "9f6a34b4-2688-4eb7-a7f5-e39fef573d0e", "false_positives": ["Legitimate application and websites that use windows paths in their URL"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1505", "reference": "https://attack.mitre.org/techniques/T1505", "name": "Server Software Component", "subtechnique": [{"id": "T1505.003", "reference": "https://attack.mitre.org/techniques/T1505/003", "name": "Web Shell"}]}]}], "tags": [], "to": "now", "references": ["https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-uri-query like~ (\"*=C:/Users*\", \"*=C:/Program%20Files*\", \"*=C:/Windows*\", \"*=C%3A%5CUsers*\", \"*=C%3A%5CProgram%20Files*\", \"*=C%3A%5CWindows*\")", "filters": [], "actions": []}
{"id": "2ea44a60-cfda-11ea-87d0-0242ac130003", "name": "SIGMA - Webshell ReGeorg Detection Via Web Logs", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Cian Heasley"], "description": "Certain strings in the uri_query field when combined with null referer and null user agent can indicate activity associated with the webshell ReGeorg.", "rule_id": "2ea44a60-cfda-11ea-87d0-0242ac130003", "false_positives": ["Web applications that use the same URL parameters as ReGeorg"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1505", "reference": "https://attack.mitre.org/techniques/T1505", "name": "Server Software Component", "subtechnique": [{"id": "T1505.003", "reference": "https://attack.mitre.org/techniques/T1505/003", "name": "Web Shell"}]}]}], "tags": [], "to": "now", "references": ["https://community.rsa.com/community/products/netwitness/blog/2019/02/19/web-shells-and-netwitness-part-3", "https://github.com/sensepost/reGeorg"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (cs-uri-query like~ (\"*cmd=read*\", \"*connect&target*\", \"*cmd=connect*\", \"*cmd=disconnect*\", \"*cmd=forward*\")) and ((?cs-referer == null) and (?cs-user-agent == null) and cs-method:\"POST\")", "filters": [], "actions": []}
{"id": "7ff9db12-1b94-4a79-ba68-a2402c5d6729", "name": "SIGMA - Windows Webshell Strings", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects common commands used in Windows webshells", "rule_id": "7ff9db12-1b94-4a79-ba68-a2402c5d6729", "false_positives": ["Web sites like wikis with articles on os commands and pages that include the os commands in the URLs", "User searches in search boxes of the respective website"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1505", "reference": "https://attack.mitre.org/techniques/T1505", "name": "Server Software Component", "subtechnique": [{"id": "T1505.003", "reference": "https://attack.mitre.org/techniques/T1505/003", "name": "Web Shell"}]}]}], "tags": [], "to": "now", "references": ["https://bad-jubies.github.io/RCE-NOW-WHAT/", "https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-method:\"GET\" and (\"=whoami\" or \"=net%20user\" or \"=net+user\" or \"=net%2Buser\" or \"=cmd%20/c%\" or \"=cmd+/c+\" or \"=cmd%2B/c%\" or \"=cmd%20/r%\" or \"=cmd+/r+\" or \"=cmd%2B/r%\" or \"=cmd%20/k%\" or \"=cmd+/k+\" or \"=cmd%2B/k%\" or \"=powershell%\" or \"=powershell+\" or \"=tasklist%\" or \"=tasklist+\" or \"=wmic%\" or \"=wmic+\" or \"=ssh%\" or \"=ssh+\" or \"=python%\" or \"=python+\" or \"=python3%\" or \"=python3+\" or \"=ipconfig\" or \"=wget%\" or \"=wget+\" or \"=curl%\" or \"=curl+\" or \"=certutil\" or \"=copy%20%5C%5C\" or \"=dsquery%\" or \"=dsquery+\" or \"=nltest%\" or \"=nltest+\")", "filters": [], "actions": []}
{"id": "65354b83-a2ea-4ea6-8414-3ab38be0d409", "name": "SIGMA - Cross Site Scripting Strings", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Saw Win Naung, Nasreddine Bencherchali"], "description": "Detects XSS attempts injected via GET requests in access logs", "rule_id": "65354b83-a2ea-4ea6-8414-3ab38be0d409", "false_positives": ["JavaScripts,CSS Files and PNG files", "User searches in search boxes of the respective website", "Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as \"User Agent\" strings and more response codes"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1189", "reference": "https://attack.mitre.org/techniques/T1189", "name": "Drive-by Compromise", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/payloadbox/xss-payload-list", "https://portswigger.net/web-security/cross-site-scripting/contexts"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where cs-method:\"GET\" and (\"=<script>\" or \"=%3Cscript%3E\" or \"=%253Cscript%253E\" or \"<iframe \" or \"%3Ciframe \" or \"<svg \" or \"%3Csvg \" or \"document.cookie\" or \"document.domain\" or \" onerror=\" or \" onresize=\" or \" onload=\\\"\" or \"onmouseover=\" or \"${alert\" or \"javascript:alert\" or \"javascript%3Aalert\") and (not sc-status:404)", "filters": [], "actions": []}
