{"id": "b640c0b8-87f8-4daa-aef8-95a24261dd1d", "name": "SIGMA - MITRE BZAR Indicators for Execution", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@neu5ron, SOC Prime"], "description": "Windows DCE-RPC functions which indicate an execution techniques on the remote system. All credit for the Zeek mapping of the suspicious endpoint/operation field goes to MITRE", "rule_id": "b640c0b8-87f8-4daa-aef8-95a24261dd1d", "false_positives": ["Windows administrator tasks or troubleshooting", "Windows management scripts or software"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "reference": "https://attack.mitre.org/techniques/T1047", "name": "Windows Management Instrumentation", "subtechnique": []}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "reference": "https://attack.mitre.org/techniques/T1053", "name": "Scheduled Task/Job", "subtechnique": [{"id": "T1053.002", "reference": "https://attack.mitre.org/techniques/T1053/002", "name": "At"}]}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "reference": "https://attack.mitre.org/techniques/T1569", "name": "System Services", "subtechnique": [{"id": "T1569.002", "reference": "https://attack.mitre.org/techniques/T1569/002", "name": "Service Execution"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/mitre-attack/bzar#indicators-for-attck-execution"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (endpoint:\"JobAdd\" and operation:\"atsvc\") or (endpoint:\"ITaskSchedulerService\" and operation:\"SchRpcEnableTask\") or (endpoint:\"ITaskSchedulerService\" and operation:\"SchRpcRegisterTask\") or (endpoint:\"ITaskSchedulerService\" and operation:\"SchRpcRun\") or (endpoint:\"IWbemServices\" and operation:\"ExecMethod\") or (endpoint:\"IWbemServices\" and operation:\"ExecMethodAsync\") or (endpoint:\"svcctl\" and operation:\"CreateServiceA\") or (endpoint:\"svcctl\" and operation:\"CreateServiceW\") or (endpoint:\"svcctl\" and operation:\"StartServiceA\") or (endpoint:\"svcctl\" and operation:\"StartServiceW\")", "filters": [], "actions": []}
{"id": "53389db6-ba46-48e3-a94c-e0f2cefe1583", "name": "SIGMA - MITRE BZAR Indicators for Persistence", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@neu5ron, SOC Prime"], "description": "Windows DCE-RPC functions which indicate a persistence techniques on the remote system. All credit for the Zeek mapping of the suspicious endpoint/operation field goes to MITRE.", "rule_id": "53389db6-ba46-48e3-a94c-e0f2cefe1583", "false_positives": ["Windows administrator tasks or troubleshooting", "Windows management scripts or software"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "reference": "https://attack.mitre.org/techniques/T1547", "name": "Boot or Logon Autostart Execution", "subtechnique": [{"id": "T1547.004", "reference": "https://attack.mitre.org/techniques/T1547/004", "name": "Winlogon Helper DLL"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/mitre-attack/bzar#indicators-for-attck-persistence"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (endpoint:\"spoolss\" and operation:\"RpcAddMonitor\") or (endpoint:\"spoolss\" and operation:\"RpcAddPrintProcessor\") or (endpoint:\"IRemoteWinspool\" and operation:\"RpcAsyncAddMonitor\") or (endpoint:\"IRemoteWinspool\" and operation:\"RpcAsyncAddPrintProcessor\") or (endpoint:\"ISecLogon\" and operation:\"SeclCreateProcessWithLogonW\") or (endpoint:\"ISecLogon\" and operation:\"SeclCreateProcessWithLogonExW\")", "filters": [], "actions": []}
{"id": "4096842a-8f9f-4d36-92b4-d0b2a62f9b2a", "name": "SIGMA - Potential PetitPotam Attack Via EFS RPC Calls", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@neu5ron, @Antonlovesdnb, Mike Remen"], "description": "Detects usage of the windows RPC library Encrypting File System Remote Protocol (MS-EFSRPC). Variations of this RPC are used within the attack refereed to as PetitPotam.\nThe usage of this RPC function should be rare if ever used at all.\nThus usage of this function is uncommon enough that any usage of this RPC function should warrant further investigation to determine if it is legitimate.\n View surrounding logs (within a few minutes before and after) from the Source IP to. Logs from from the Source IP would include dce_rpc, smb_mapping, smb_files, rdp, ntlm, kerberos, etc..'\n", "rule_id": "4096842a-8f9f-4d36-92b4-d0b2a62f9b2a", "false_positives": ["Uncommon but legitimate windows administrator or software tasks that make use of the Encrypting File System RPC Calls. Verify if this is common activity (see description)."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1557", "reference": "https://attack.mitre.org/techniques/T1557", "name": "Adversary-in-the-Middle", "subtechnique": [{"id": "T1557.001", "reference": "https://attack.mitre.org/techniques/T1557/001", "name": "LLMNR/NBT-NS Poisoning and SMB Relay"}]}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1187", "reference": "https://attack.mitre.org/techniques/T1187", "name": "Forced Authentication", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/topotam/PetitPotam/blob/d83ac8f2dd34654628c17490f99106eb128e7d1e/PetitPotam/PetitPotam.cpp", "https://msrc.microsoft.com/update-guide/vulnerability/ADV210003", "https://vx-underground.org/archive/Symantec/windows-vista-network-attack-07-en.pdf", "https://threatpost.com/microsoft-petitpotam-poc/168163/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where operation:\"efs*\"", "filters": [], "actions": []}
{"id": "7b33baef-2a75-4ca3-9da4-34f9a15382d8", "name": "SIGMA - Possible PrintNightmare Print Driver Install", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@neu5ron (Nate Guagenti)"], "description": "Detects the remote installation of a print driver which is possible indication of the exploitation of PrintNightmare (CVE-2021-1675).\nThe occurrence of print drivers being installed remotely via RPC functions should be rare, as print drivers are normally installed locally and or through group policy.\n", "rule_id": "7b33baef-2a75-4ca3-9da4-34f9a15382d8", "false_positives": ["Legitimate remote alteration of a printer driver."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-execution", "cve-2021-1678", "cve-2021-1675", "cve-2021-34527"], "to": "now", "references": ["https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-par/93d1915d-4d9f-4ceb-90a7-e8f2a59adc29", "https://github.com/zeek/zeek/blob/691b099de13649d6576c7b9d637f8213ff818832/scripts/base/protocols/dce-rpc/consts.zeek", "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527", "https://github.com/corelight/CVE-2021-1675", "https://old.zeek.org/zeekweek2019/slides/bzar.pdf", "https://www.crowdstrike.com/blog/cve-2021-1678-printer-spooler-relay-security-advisory/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where operation like~ (\"RpcAsyncInstallPrinterDriverFromPackage\", \"RpcAsyncAddPrintProcessor\", \"RpcAddPrintProcessor\", \"RpcAddPrinterDriverEx\", \"RpcAddPrinterDriver\", \"RpcAsyncAddPrinterDriver\")", "filters": [], "actions": []}
{"id": "bae2865c-5565-470d-b505-9496c87d0c30", "name": "SIGMA - SMB Spoolss Name Piped Usage", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["OTR (Open Threat Research), @neu5ron"], "description": "Detects the use of the spoolss named pipe over SMB. This can be used to trigger the authentication via NTLM of any machine that has the spoolservice enabled.", "rule_id": "bae2865c-5565-470d-b505-9496c87d0c30", "false_positives": ["Domain Controllers that are sometimes, commonly although should not be, acting as printer servers too"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.002", "reference": "https://attack.mitre.org/techniques/T1021/002", "name": "SMB/Windows Admin Shares"}]}]}], "tags": [], "to": "now", "references": ["https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1", "https://dirkjanm.io/a-different-way-of-abusing-zerologon/", "https://twitter.com/_dirkjan/status/1309214379003588608"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where path:\"*IPC$\" and name:\"spoolss\"", "filters": [], "actions": []}
{"id": "7100f7e3-92ce-4584-b7b7-01b40d3d4118", "name": "SIGMA - Default Cobalt Strike Certificate", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Bhabesh Raj"], "description": "Detects the presence of default Cobalt Strike certificate in the HTTPS traffic", "rule_id": "7100f7e3-92ce-4584-b7b7-01b40d3d4118", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": [], "to": "now", "references": ["https://sergiusechel.medium.com/improving-the-network-based-detection-of-cobalt-strike-c2-servers-in-the-wild-while-reducing-the-6964205f6468"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where certificate.serial:\"8BB00EE\"", "filters": [], "actions": []}
{"id": "5588576c-5898-4fac-bcdd-7475a60e8f43", "name": "SIGMA - Suspicious DNS Query Indicating Kerberos Coercion via DNS Object SPN Spoofing - Network", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Swachchhanda Shrawan Poudel (Nextron Systems)"], "description": "Detects DNS queries containing patterns associated with Kerberos coercion attacks via DNS object spoofing.\nThe pattern \"1UWhRCAAAAA..BAAAA\" is a base64-encoded signature that corresponds to a marshaled CREDENTIAL_TARGET_INFORMATION structure.\nAttackers can use this technique to coerce authentication from victim systems to attacker-controlled hosts.\nIt is one of the strong indicators of a Kerberos coercion attack, where adversaries manipulate DNS records\nto spoof Service Principal Names (SPNs) and redirect authentication requests like CVE-2025-33073.\n", "rule_id": "5588576c-5898-4fac-bcdd-7475a60e8f43", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1557", "reference": "https://attack.mitre.org/techniques/T1557", "name": "Adversary-in-the-Middle", "subtechnique": [{"id": "T1557.001", "reference": "https://attack.mitre.org/techniques/T1557/001", "name": "LLMNR/NBT-NS Poisoning and SMB Relay"}]}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1187", "reference": "https://attack.mitre.org/techniques/T1187", "name": "Forced Authentication", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025", "https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query:\"*UWhRCA*\" and query:\"*BAAAA*\"", "filters": [], "actions": []}
{"id": "bf74135c-18e8-4a72-a926-0e4f47888c19", "name": "SIGMA - DNS Events Related To Mining Pools", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Saw Winn Naung, Azure-Sentinel, @neu5ron"], "description": "Identifies clients that may be performing DNS lookups associated with common currency mining pools.", "rule_id": "bf74135c-18e8-4a72-a926-0e4f47888c19", "false_positives": ["A DNS lookup does not necessarily  mean a successful attempt, verify a) if there was a response using the zeek answers field, if there was then verify the connections (conn.log) to those IPs. b) verify if HTTP, SSL, or TLS activity to the domain that was queried. http.log field is 'host' and ssl/tls is 'server_name'."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "reference": "https://attack.mitre.org/techniques/T1569", "name": "System Services", "subtechnique": [{"id": "T1569.002", "reference": "https://attack.mitre.org/techniques/T1569/002", "name": "Service Execution"}]}]}, {"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1496", "reference": "https://attack.mitre.org/techniques/T1496", "name": "Resource Hijacking", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/Azure/Azure-Sentinel/blob/fa0411f9424b6c47b4d5a20165e4f1b168c1f103/Detections/ASimDNS/imDNS_Miners.yaml"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (query like~ (\"*monerohash.com\", \"*do-dear.com\", \"*xmrminerpro.com\", \"*secumine.net\", \"*xmrpool.com\", \"*minexmr.org\", \"*hashanywhere.com\", \"*xmrget.com\", \"*mininglottery.eu\", \"*minergate.com\", \"*moriaxmr.com\", \"*multipooler.com\", \"*moneropools.com\", \"*xmrpool.eu\", \"*coolmining.club\", \"*supportxmr.com\", \"*minexmr.com\", \"*hashvault.pro\", \"*xmrpool.net\", \"*crypto-pool.fr\", \"*xmr.pt\", \"*miner.rocks\", \"*walpool.com\", \"*herominers.com\", \"*gntl.co.uk\", \"*semipool.com\", \"*coinfoundry.org\", \"*cryptoknight.cc\", \"*fairhash.org\", \"*baikalmine.com\", \"*tubepool.xyz\", \"*fairpool.xyz\", \"*asiapool.io\", \"*coinpoolit.webhop.me\", \"*nanopool.org\", \"*moneropool.com\", \"*miner.center\", \"*prohash.net\", \"*poolto.be\", \"*cryptoescrow.eu\", \"*monerominers.net\", \"*cryptonotepool.org\", \"*extrmepool.org\", \"*webcoin.me\", \"*kippo.eu\", \"*hashinvest.ws\", \"*monero.farm\", \"*linux-repository-updates.com\", \"*1gh.com\", \"*dwarfpool.com\", \"*hash-to-coins.com\", \"*pool-proxy.com\", \"*hashfor.cash\", \"*fairpool.cloud\", \"*litecoinpool.org\", \"*mineshaft.ml\", \"*abcxyz.stream\", \"*moneropool.ru\", \"*cryptonotepool.org.uk\", \"*extremepool.org\", \"*extremehash.com\", \"*hashinvest.net\", \"*unipool.pro\", \"*crypto-pools.org\", \"*monero.net\", \"*backup-pool.com\", \"*mooo.com\", \"*freeyy.me\", \"*cryptonight.net\", \"*shscrypto.net\")) and (not ((answers like~ (\"127.0.0.1\", \"0.0.0.0\")) or rejected:\"true\"))", "filters": [], "actions": []}
{"id": "fa7703d6-0ee8-4949-889c-48c84bc15b6f", "name": "SIGMA - New Kind of Network (NKN) Detection", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Michael Portera (@mportatoes)"], "description": "NKN is a networking service using blockchain technology to support a decentralized network of peers. While there are legitimate uses for it, it can also be used as a C2 channel. This rule looks for a DNS request to the ma>", "rule_id": "fa7703d6-0ee8-4949-889c-48c84bc15b6f", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-command-and-control"], "to": "now", "references": ["https://github.com/nknorg/nkn-sdk-go", "https://unit42.paloaltonetworks.com/manageengine-godzilla-nglite-kdcsponge/", "https://github.com/Maka8ka/NGLite"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query:\"*seed*\" and query:\"*.nkn.org*\"", "filters": [], "actions": []}
{"id": "ede05abc-2c9e-4624-9944-9ff17fdc0bf5", "name": "SIGMA - Suspicious DNS Z Flag Bit Set", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@neu5ron, SOC Prime Team, Corelight"], "description": "The DNS Z flag is bit within the DNS protocol header that is, per the IETF design, meant to be used reserved (unused).\nAlthough recently it has been used in DNSSec, the value being set to anything other than 0 should be rare.\nOtherwise if it is set to non 0 and DNSSec is being used, then excluding the legitimate domains is low effort and high reward.\nDetermine if multiple of these files were accessed in a short period of time to further enhance the possibility of seeing if this was a one off or the possibility of larger sensitive file gathering.\nThis Sigma query is designed to accompany the Corelight Threat Hunting Guide, which can be found here: https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs'\n", "rule_id": "ede05abc-2c9e-4624-9944-9ff17fdc0bf5", "false_positives": ["Internal or legitimate external domains using DNSSec. Verify if these are legitimate DNSSec domains and then exclude them.", "If you work in a Public Sector then it may be good to exclude things like endswith \".edu\", \".gov\" and or \".mil\""], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1095", "reference": "https://attack.mitre.org/techniques/T1095", "name": "Non-Application Layer Protocol", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://twitter.com/neu5ron/status/1346245602502443009", "https://tdm.socprime.com/tdm/info/eLbyj4JjI15v#sigma", "https://tools.ietf.org/html/rfc2929#section-2.1", "https://www.netresec.com/?page=Blog&month=2021-01&post=Finding-Targeted-SUNBURST-Victims-with-pDNS"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (not Z:0) and query:\"*.*\" and (not ((query like~ (\"*.arpa\", \"*.local\", \"*.ultradns.net\", \"*.twtrdns.net\", \"*.azuredns-prd.info\", \"*.azure-dns.com\", \"*.azuredns-ff.info\", \"*.azuredns-ff.org\", \"*.azuregov-dns.org\")) or (qtype_name like~ (\"ns\", \"mx\")) or answers:\"*\\\\x00\" or (id.resp_p like~ (137, 138, 139))))", "filters": [], "actions": []}
{"id": "a8322756-015c-42e7-afb1-436e85ed3ff5", "name": "SIGMA - DNS TOR Proxies", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Saw Winn Naung , Azure-Sentinel"], "description": "Identifies IPs performing DNS lookups associated with common Tor proxies.", "rule_id": "a8322756-015c-42e7-afb1-436e85ed3ff5", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1048", "reference": "https://attack.mitre.org/techniques/T1048", "name": "Exfiltration Over Alternative Protocol", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/ASimDNS/imDNS_TorProxies.yaml"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where query like~ (\"*.hiddenservice.net\", \"*.onion.ca\", \"*.onion.cab\", \"*.onion.casa\", \"*.onion.city\", \"*.onion.direct\", \"*.onion.dog\", \"*.onion.glass\", \"*.onion.gq\", \"*.onion.guide\", \"*.onion.in.net\", \"*.onion.ink\", \"*.onion.it\", \"*.onion.link\", \"*.onion.lt\", \"*.onion.lu\", \"*.onion.ly\", \"*.onion.mn\", \"*.onion.network\", \"*.onion.nu\", \"*.onion.pet\", \"*.onion.plus\", \"*.onion.pt\", \"*.onion.pw\", \"*.onion.rip\", \"*.onion.sh\", \"*.onion.si\", \"*.onion.to\", \"*.onion.top\", \"*.onion.ws\", \"*.onion\", \"*.s1.tor-gateways.de\", \"*.s2.tor-gateways.de\", \"*.s3.tor-gateways.de\", \"*.s4.tor-gateways.de\", \"*.s5.tor-gateways.de\", \"*.t2w.pw\", \"*.tor2web.ae.org\", \"*.tor2web.blutmagie.de\", \"*.tor2web.com\", \"*.tor2web.fi\", \"*.tor2web.io\", \"*.tor2web.org\", \"*.tor2web.xyz\", \"*.torlink.co\")", "filters": [], "actions": []}
{"id": "aac2fd97-bcba-491b-ad66-a6edf89c71bf", "name": "SIGMA - Executable from Webdav", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["SOC Prime, Adam Swan"], "description": "Detects executable access via webdav6. Can be seen in APT 29 such as from the emulated APT 29 hackathon https://github.com/OTRF/detection-hackathon-apt29/", "rule_id": "aac2fd97-bcba-491b-ad66-a6edf89c71bf", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0011", "reference": "https://attack.mitre.org/tactics/TA0011", "name": "Command-And-Control"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1105", "reference": "https://attack.mitre.org/techniques/T1105", "name": "Ingress Tool Transfer", "subtechnique": []}]}], "tags": [], "to": "now", "references": ["http://carnal0wnage.attackresearch.com/2012/06/webdav-server-to-download-custom.html", "https://github.com/OTRF/detection-hackathon-apt29"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (c-useragent:\"*WebDAV*\" or c-uri:\"*webdav*\") and (resp_mime_types:\"*dosexec*\" or c-uri:\"*.exe\")", "filters": [], "actions": []}
{"id": "ab6b1a39-a9ee-4ab4-b075-e83acf6e346b", "name": "SIGMA - OMIGOD HTTP No Authentication RCE", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Nate Guagenti (neu5ron)"], "description": "Detects the exploitation of OMIGOD (CVE-2021-38647) which allows remote execute (RCE) commands as root with just a single unauthenticated HTTP request.\nVerify, successful, exploitation by viewing the HTTP client (request) body to see what was passed to the server (using PCAP).\nWithin the client body is where the code execution would occur. Additionally, check the endpoint logs to see if suspicious commands or activity occurred within the timeframe of this HTTP request.\n", "rule_id": "ab6b1a39-a9ee-4ab4-b075-e83acf6e346b", "false_positives": ["Exploits that were attempted but unsuccessful.", "Scanning attempts with the abnormal use of the HTTP POST method with no indication of code execution within the HTTP Client (Request) body. An example would be vulnerability scanners trying to identify unpatched versions while not actually exploiting the vulnerability. See description for investigation tips."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1068", "reference": "https://attack.mitre.org/techniques/T1068", "name": "Exploitation for Privilege Escalation", "subtechnique": []}]}, {"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1203", "reference": "https://attack.mitre.org/techniques/T1203", "name": "Exploitation for Client Execution", "subtechnique": []}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.006", "reference": "https://attack.mitre.org/techniques/T1021/006", "name": "Windows Remote Management"}]}]}], "tags": [], "to": "now", "references": ["https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure", "https://twitter.com/neu5ron/status/1438987292971053057?s=20"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (status_code:200 and uri:\"/wsman\" and method:\"POST\") and (not client_header_names:\"*AUTHORIZATION*\") and (not request_body_len:0)", "filters": [], "actions": []}
{"id": "68c2c604-92ad-468b-bf4a-aac49adad08c", "name": "SIGMA - HTTP Request to Low Reputation TLD or Suspicious File Extension", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@signalblur, Corelight"], "description": "Detects HTTP requests to low reputation TLDs (e.g. .xyz, .top, .ru) or ending in suspicious file extensions (.exe, .dll, .hta), which may indicate malicious activity.\n", "rule_id": "68c2c604-92ad-468b-bf4a-aac49adad08c", "false_positives": ["Rare legitimate software downloads from low quality TLDs"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": [], "to": "now", "references": ["https://www.howtogeek.com/137270/50-file-extensions-that-are-potentially-dangerous-on-windows", "https://www.spamhaus.org/reputation-statistics/cctlds/domains/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (host like~ (\"*.bid\", \"*.by\", \"*.cf\", \"*.click\", \"*.cm\", \"*.ga\", \"*.gq\", \"*.ir\", \"*.kp\", \"*.loan\", \"*.ml\", \"*.mm\", \"*.party\", \"*.pw\", \"*.ru\", \"*.su\", \"*.sy\", \"*.tk\", \"*.top\", \"*.tv\", \"*.ve\", \"*.work\", \"*.xyz\")) and ((uri like~ (\"*.bat\", \"*.bin\", \"*.cmd\", \"*.cpl\", \"*.dll\", \"*.dylib\", \"*.elf\", \"*.exe\", \"*.hta\", \"*.iso\", \"*.jar\", \"*.js\", \"*.lnk\", \"*.msi\", \"*.pif\", \"*.ps1\", \"*.py\", \"*.reg\", \"*.scr\", \"*.sh\", \"*.so\", \"*.vbs\", \"*.wsf\")) or (resp_mime_types like~ (\"application/vnd.microsoft.portable-executable\", \"application/x-bat\", \"application/x-dosexec\", \"application/x-elf\", \"application/x-iso9660-image\", \"application/x-java-archive\", \"application/x-ms-shortcut\", \"application/x-msdos-program\", \"application/x-msdownload\", \"application/x-python-code\", \"application/x-sh\")))", "filters": [], "actions": []}
{"id": "705072a5-bb6f-4ced-95b6-ecfa6602090b", "name": "SIGMA - WebDav Put Request", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)"], "description": "A General detection for WebDav user-agent being used to PUT files on a WebDav network share. This could be an indicator of exfiltration.", "rule_id": "705072a5-bb6f-4ced-95b6-ecfa6602090b", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 21, "severity": "low", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1048", "reference": "https://attack.mitre.org/techniques/T1048", "name": "Exfiltration Over Alternative Protocol", "subtechnique": [{"id": "T1048.003", "reference": "https://attack.mitre.org/techniques/T1048/003", "name": "Exfiltration Over Unencrypted Non-C2 Protocol"}]}]}], "tags": [], "to": "now", "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/17"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (user_agent:\"*WebDAV*\" and method:\"PUT\") and (not (cidrMatch(id.resp_h, \"10.0.0.0/8\") or cidrMatch(id.resp_h, \"127.0.0.0/8\") or cidrMatch(id.resp_h, \"172.16.0.0/12\") or cidrMatch(id.resp_h, \"192.168.0.0/16\") or cidrMatch(id.resp_h, \"169.254.0.0/16\")))", "filters": [], "actions": []}
{"id": "1fc0809e-06bf-4de3-ad52-25e5263b7623", "name": "SIGMA - Publicly Accessible RDP Service", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Josh Brower @DefensiveDepth"], "description": "Detects connections from routable IPs to an RDP listener. Which is indicative of a publicly-accessible RDP service.\n", "rule_id": "1fc0809e-06bf-4de3-ad52-25e5263b7623", "false_positives": ["Although it is recommended to NOT have RDP exposed to the internet, verify that this is a) allowed b) the server has not already been compromised via some brute force or remote exploit since it has been exposed to the internet. Work to secure the server if you are unable to remove it from being exposed to the internet."], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.001", "reference": "https://attack.mitre.org/techniques/T1021/001", "name": "Remote Desktop Protocol"}]}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where not (cidrMatch(id.orig_h, \"::1/128\") or cidrMatch(id.orig_h, \"10.0.0.0/8\") or cidrMatch(id.orig_h, \"127.0.0.0/8\") or cidrMatch(id.orig_h, \"172.16.0.0/12\") or cidrMatch(id.orig_h, \"192.168.0.0/16\") or cidrMatch(id.orig_h, \"169.254.0.0/16\") or cidrMatch(id.orig_h, \"2620:83:8000::/48\") or cidrMatch(id.orig_h, \"fc00::/7\") or cidrMatch(id.orig_h, \"fe80::/10\"))", "filters": [], "actions": []}
{"id": "dde85b37-40cd-4a94-b00c-0b8794f956b5", "name": "SIGMA - Remote Task Creation via ATSVC Named Pipe - Zeek", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Samir Bousseaden, @neu5rn"], "description": "Detects remote task creation via at.exe or API interacting with ATSVC namedpipe", "rule_id": "dde85b37-40cd-4a94-b00c-0b8794f956b5", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege-Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "reference": "https://attack.mitre.org/techniques/T1053", "name": "Scheduled Task/Job", "subtechnique": [{"id": "T1053.002", "reference": "https://attack.mitre.org/techniques/T1053/002", "name": "At"}]}]}], "tags": ["car-2013-05-004", "car-2015-04-001"], "to": "now", "references": ["https://web.archive.org/web/20230409194125/https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where path:\"\\\\\\*\\\\IPC$\" and name:\"atsvc\"", "filters": [], "actions": []}
{"id": "92dae1ed-1c9d-4eff-a567-33acbd95b00e", "name": "SIGMA - Possible Impacket SecretDump Remote Activity - Zeek", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Samir Bousseaden, @neu5ron"], "description": "Detect AD credential dumping using impacket secretdump HKTL. Based on the SIGMA rules/windows/builtin/win_impacket_secretdump.yml", "rule_id": "92dae1ed-1c9d-4eff-a567-33acbd95b00e", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.002", "reference": "https://attack.mitre.org/techniques/T1003/002", "name": "Security Account Manager"}]}]}], "tags": [], "to": "now", "references": ["https://web.archive.org/web/20230329153811/https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (path:\"*\\\\*\" and path:\"*ADMIN$*\") and name:\"*SYSTEM32\\\\*\" and name:\"*.tmp\"", "filters": [], "actions": []}
{"id": "021310d9-30a6-480a-84b7-eaa69aeb92bb", "name": "SIGMA - First Time Seen Remote Named Pipe - Zeek", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Samir Bousseaden, @neu5ron, Tim Shelton"], "description": "This detection excludes known namped pipes accessible remotely and notify on newly observed ones, may help to detect lateral movement and remote exec using named pipes", "rule_id": "021310d9-30a6-480a-84b7-eaa69aeb92bb", "false_positives": ["Update the excluded named pipe to filter out any newly observed legit named pipe"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.002", "reference": "https://attack.mitre.org/techniques/T1021/002", "name": "SMB/Windows Admin Shares"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/menasec1/status/1104489274387451904"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where path:\"\\\\\\\\\\*\\\\IPC$\" and (not (\"samr\" or \"lsarpc\" or \"winreg\" or \"netlogon\" or \"srvsvc\" or \"protected_storage\" or \"wkssvc\" or \"browser\" or \"netdfs\" or \"svcctl\" or \"spoolss\" or \"ntsvcs\" or \"LSM_API_service\" or \"HydraLsPipe\" or \"TermSrv_API_service\" or \"MsFteWds\"))", "filters": [], "actions": []}
{"id": "f1b3a22a-45e6-4004-afb5-4291f9c21166", "name": "SIGMA - Suspicious PsExec Execution - Zeek", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Samir Bousseaden, @neu5ron, Tim Shelton"], "description": "detects execution of psexec or paexec with renamed service name, this rule helps to filter out the noise if psexec is used for legit purposes or if attacker uses a different psexec client other than sysinternal one", "rule_id": "f1b3a22a-45e6-4004-afb5-4291f9c21166", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral-Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "reference": "https://attack.mitre.org/techniques/T1021", "name": "Remote Services", "subtechnique": [{"id": "T1021.002", "reference": "https://attack.mitre.org/techniques/T1021/002", "name": "SMB/Windows Admin Shares"}]}]}], "tags": [], "to": "now", "references": ["https://web.archive.org/web/20230329171218/https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where ((path:\"*\\\\*\" and path:\"*\\\\IPC$*\") and (name like~ (\"*-stdin\", \"*-stdout\", \"*-stderr\"))) and (not name:\"PSEXESVC*\")", "filters": [], "actions": []}
{"id": "286b47ed-f6fe-40b3-b3a8-35129acd43bc", "name": "SIGMA - Suspicious Access to Sensitive File Extensions - Zeek", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Samir Bousseaden, @neu5ron"], "description": "Detects known sensitive file extensions via Zeek", "rule_id": "286b47ed-f6fe-40b3-b3a8-35129acd43bc", "false_positives": ["Help Desk operator doing backup or re-imaging end user machine or backup software", "Users working with these data types or exchanging message files"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [], "tags": ["attack-collection"], "to": "now", "references": ["Internal Research"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where name like~ (\"*.pst\", \"*.ost\", \"*.msg\", \"*.nst\", \"*.oab\", \"*.edb\", \"*.nsf\", \"*.bak\", \"*.dmp\", \"*.kirbi\", \"*.rdp\")", "filters": [], "actions": []}
{"id": "2e69f167-47b5-4ae7-a390-47764529eff5", "name": "SIGMA - Transferring Files with Credential Data via Network Shares - Zeek", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["@neu5ron, Teymur Kheirkhabarov, oscd.community"], "description": "Transferring files with well-known filenames (sensitive files with credential data) using network shares", "rule_id": "2e69f167-47b5-4ae7-a390-47764529eff5", "false_positives": ["Transferring sensitive files for legitimate administration work by legitimate administrator"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.002", "reference": "https://attack.mitre.org/techniques/T1003/002", "name": "Security Account Manager"}]}]}], "tags": [], "to": "now", "references": ["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where name like~ (\"\\\\mimidrv\", \"\\\\lsass\", \"\\\\windows\\\\minidump\\\\\", \"\\\\hiberfil\", \"\\\\sqldmpr\", \"\\\\sam\", \"\\\\ntds.dit\", \"\\\\security\")", "filters": [], "actions": []}
{"id": "503fe26e-b5f2-4944-a126-eab405cc06e5", "name": "SIGMA - Kerberos Network Traffic RC4 Ticket Encryption", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["sigma"], "description": "Detects kerberos TGS request using RC4 encryption which may be indicative of kerberoasting", "rule_id": "503fe26e-b5f2-4944-a126-eab405cc06e5", "false_positives": ["Normal enterprise SPN requests activity"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "severity": "medium", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1558", "reference": "https://attack.mitre.org/techniques/T1558", "name": "Steal or Forge Kerberos Tickets", "subtechnique": [{"id": "T1558.003", "reference": "https://attack.mitre.org/techniques/T1558/003", "name": "Kerberoasting"}]}]}], "tags": [], "to": "now", "references": ["https://adsecurity.org/?p=3458"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (request_type:\"TGS\" and cipher:\"rc4-hmac\") and (not service:\"$*\")", "filters": [], "actions": []}
